 
                              IC Compiler II (TM)

                  Version W-2024.09 for linux64 - Aug 26, 2024
  This release has significant feature enhancements. Please review the Release
                       Notes associated with this release.

                    Copyright (c) 1988 - 2024 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)

Loading user preference file /home/student/.synopsys_icc2_gui/preferences.tcl
Information: Term was not able to be set up using xterm-256color . Using "xterm" by default instead. (CLE-10)
icc2_shell> source scripts/floorplan.tcl
Information: Reading Verilog into new design 'full_adder_8bit_v' in library 'FULL_ADDER_8BIT_LIB'. (VR-012)
Loading verilog file '/home/student/Documents/RTL2GDSII/DC/results/full_adder_8bit.mapped.v'
Number of modules read: 1
Top level ports: 27
Total ports in all modules: 27
Total nets in all modules: 138
Total instances in all modules: 103
Elapsed = 00:00:00.00, CPU = 00:00:00.00
[icc2-lic Thu Jun  5 11:05:10 2025] Command 'initialize_floorplan' requires licenses
[icc2-lic Thu Jun  5 11:05:10 2025] Sending authorization request for 'ICCompilerII'
[icc2-lic Thu Jun  5 11:05:11 2025] Authorization request for 'ICCompilerII' failed (-5)
[icc2-lic Thu Jun  5 11:05:11 2025] Sending authorization request for 'ICCompilerII-4'
[icc2-lic Thu Jun  5 11:05:11 2025] Authorization request for 'ICCompilerII-4' failed (-5)
[icc2-lic Thu Jun  5 11:05:11 2025] Sending authorization request for 'ICCompilerII-8'
[icc2-lic Thu Jun  5 11:05:11 2025] Authorization request for 'ICCompilerII-8' succeeded
[icc2-lic Thu Jun  5 11:05:11 2025] Sending authorization request for 'ICCompilerII-NX'
[icc2-lic Thu Jun  5 11:05:11 2025] Authorization request for 'ICCompilerII-NX' succeeded
[icc2-lic Thu Jun  5 11:05:11 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:05:11 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:11 2025] Count request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:11 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:05:11 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:11 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:11 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:11 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:11 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:11 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:11 2025] Count request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:11 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out of alternate set of keys directly with queueing was successful
Using libraries: FULL_ADDER_8BIT_LIB saed32rvt_c
Linking block FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design
Information: User units loaded from library 'saed32rvt_c' (LNK-040)
Design 'full_adder_8bit' was successfully linked.
Removing existing floorplan objects
Creating core...
Core utilization ratio = 84.32%
Unplacing all cells...
Creating site array...
Creating routing tracks...
Initializing floorplan completed.
Information: The command 'set_individual_pin_constraints' cleared the undo history. (UNDO-016)
[icc2-lic Thu Jun  5 11:05:12 2025] Command 'place_pins' requires licenses
[icc2-lic Thu Jun  5 11:05:12 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out of alternate set of keys directly with queueing was successful
Information: Starting 'place_pins' (FLW-8000)
Information: Time: 2025-06-05 11:05:12 / Session:  00:00:23 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 393 MB (FLW-8100)
Load DB...
CPU Time for load db: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 

Min routing layer: M1
Max routing layer: MRDL


CPU Time for Top Level Pre-Route Processing: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
CPU Time for Leaf Level Pre-Route Processing: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Warning: found large number of corner keepout wiretracks on side 1 of block full_adder_8bit on layer M9 and there is no enough wire tracks available on this side (DPPA-096)
Warning: found large number of corner keepout wiretracks on side 2 of block full_adder_8bit on layer MRDL and there is no enough wire tracks available on this side (DPPA-096)
Warning: found large number of corner keepout wiretracks on side 3 of block full_adder_8bit on layer M9 and there is no enough wire tracks available on this side (DPPA-096)
Warning: found large number of corner keepout wiretracks on side 4 of block full_adder_8bit on layer MRDL and there is no enough wire tracks available on this side (DPPA-096)
Number of block ports: 27
Number of block pin locations assigned from router: 0
CPU Time for Pin Preparation: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Number of PG ports on blocks: 0
Number of pins created: 27
CPU Time for Pin Creation: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Total Pin Placement CPU Time: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Information: Ending   'place_pins' (FLW-8001)
Information: Time: 2025-06-05 11:05:12 / Session:  00:00:23 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 394 MB (FLW-8100)
[icc2-lic Thu Jun  5 11:05:12 2025] Command 'create_placement' requires licenses
[icc2-lic Thu Jun  5 11:05:12 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out of alternate set of keys directly with queueing was successful
Information: Starting 'create_placement' (FLW-8000)
Information: Time: 2025-06-05 11:05:12 / Session:  00:00:23 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 394 MB (FLW-8100)
Creating appropriate block views (if needed)...
Multi-Processing Summary
  Max number of cores for parent process: 1; hostname: ict-chipin.sot.pdpu.ac.in
  No distributed processing
Command Option Settings Summary
  -floorplan -effort high
Info: starting to push down row track for sub-blocks.
Information: All hard macros are fixed, no hard macro placement is done. (DPP-416)
Generating automatic soft blockages for full_adder_8bit_v, hor/vert channel sizes are 6.688/6.688
Placing top level std cells.
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
Warning: no valid parasitic for default corner(LATE) (NEX-018)
Warning: no valid parasitic for default corner(LATE) (NEX-018)
Warning: no valid parasitic for default corner(LATE) (NEX-018)
Warning: no valid parasitic for default corner(LATE) (NEX-018)
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
coarse place 0% done.
coarse place 33% done.
coarse place 67% done.
coarse place 100% done.
Running block placement.
Floorplan placement done.
[icc2-lic Thu Jun  5 11:05:12 2025] Command 'report_placement' requires licenses
[icc2-lic Thu Jun  5 11:05:12 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:12 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:12 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:12 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:12 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : report_placement
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:05:12 2025
****************************************
  ==================
  Note: Ignoring violations of fixed cells or between fixed pairs of cells. 
        To include violations of / between fixed cells, disable -ignore_fixed. 
  ==================

  Wire length report (all)
  ==================
  wire length in design full_adder_8bit_v: 769.405 microns.
  wire length in design full_adder_8bit_v (see through blk pins): 769.405 microns.
  ------------------
  Total wire length: 769.405 microns.

  Physical hierarchy violations report
  ====================================
  Violations in design full_adder_8bit_v:
     0 cells have placement violation.
  ------------------------------------
  Total 0 cells have placement violation.

  Voltage area violations report
  ====================================
  Voltage area placement violations in design full_adder_8bit_v:
     0 cells placed outside the voltage area which they belong to.
  ------------------------------------
  Total 0 macro cells placed outside the voltage area which they belong to.

  Hard macro to hard macro overlap report
  =======================================
  HM to HM overlaps in design full_adder_8bit_v: 0
  ---------------------------------------
  Total hard macro to hard macro overlaps: 0

Information: Default error view full_adder_8bit_v_dpplace.err is created in GUI error browser. (DPP-054)
Information: Elapsed time for create_placement excluding pending time: 00:00:00.29. (DPUI-902)
Information: CPU time for create_placement : 00:00:00.19. (DPUI-903)
Information: Peak memory usage for create_placement : 501 MB. (DPUI-904)
Information: Ending   'create_placement' (FLW-8001)
Information: Time: 2025-06-05 11:05:12 / Session:  00:00:23 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 502 MB (FLW-8100)
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
Information: Saving block 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'
Saving library 'FULL_ADDER_8BIT_LIB'
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
Information: Saving 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design' to 'FULL_ADDER_8BIT_LIB:FULL_ADD_8BIT_Floorplan.design'. (DES-028)
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
Saving library 'FULL_ADDER_8BIT_LIB'
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
icc2_shell> start_gui
icc2_shell> report_qor
[icc2-lic Thu Jun  5 11:05:29 2025] Command 'report_qor' requires licenses
[icc2-lic Thu Jun  5 11:05:29 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:05:29 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:29 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:29 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:05:29 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:29 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:29 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:29 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:29 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:29 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:29 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:29 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:05:29 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:29 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:29 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:29 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:29 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:29 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : qor
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:05:29 2025
****************************************
Warning: no valid parasitic for default corner(LATE) (NEX-018)
Warning: no valid parasitic for default corner(EARLY) (NEX-018)
Warning: no valid parasitic for (all corners) corner((both specs)) (NEX-018)
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Warning: The extractor can not be initialized for block 'full_adder_8bit_v'. (TIM-103)
Warning: The extractor can not be initialized for design 'full_adder_8bit'. Zero interconnect delay is used in timing analysis. (TIM-102)
Warning: Batch extraction is skipped for block "full_adder_8bit"
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 0, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
************************************************************
Timer Settings:
Delay Calculation Style:                   auto
Signal Integrity Analysis:                 disabled
Timing Window Analysis:                    disabled
Advanced Waveform Propagation:             disabled
Variation Type:                            fixed_derate
Clock Reconvergence Pessimism Removal:     disabled
Advanced Receiver Model:                   disabled
LLE:                                       disabled
ML Acceleration:                           off
Smart Arc Optimization:                    disabled
************************************************************



Cell Count
----------------------------------------
Hierarchical Cell Count:              0
Hierarchical Port Count:              0
Leaf Cell Count:                    103
Buf/Inv Cell Count:                   0
Buf Cell Count:                       0
Inv Cell Count:                       0
Combinational Cell Count:            77
   Single-bit Isolation Cell Count:                        0
   Multi-bit Isolation Cell Count:                         0
   Isolation Cell Banking Ratio:                           0.00%
   Single-bit Level Shifter Cell Count:                    0
   Multi-bit Level Shifter Cell Count:                     0
   Level Shifter Cell Banking Ratio:                       0.00%
   Single-bit ELS Cell Count:                              0
   Multi-bit ELS Cell Count:                               0
   ELS Cell Banking Ratio:                                 0.00%
Sequential Cell Count:               26
   Integrated Clock-Gating Cell Count:                     0
   Sequential Macro Cell Count:                            0
   Single-bit Sequential Cell Count:                       26
   Multi-bit Sequential Cell Count:                        0
   Sequential Cell Banking Ratio:                          0.00%
   BitsPerflop:                                            1.00
Macro Count:                          0
----------------------------------------


Area
----------------------------------------
Combinational Area:              129.36
Noncombinational Area:           179.43
Buf/Inv Area:                      0.00
Total Buffer Area:                 0.00
Total Inverter Area:               0.00
Macro/Black Box Area:              0.00
Net Area:                             0
Net XLength:                     486.05
Net YLength:                     407.51
----------------------------------------
Cell Area (netlist):                            308.78
Cell Area (netlist and physical only):          308.79
Net Length:                      893.55


Design Rules
----------------------------------------
Total Number of Nets:               138
Nets with Violations:                 0
Max Trans Violations:                 0
Max Cap Violations:                   0
----------------------------------------

1
icc2_shell> report_timing
[icc2-lic Thu Jun  5 11:05:36 2025] Command 'report_timing' requires licenses
[icc2-lic Thu Jun  5 11:05:36 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:05:36 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:36 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:36 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:05:36 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:36 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:36 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:05:36 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:05:36 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:05:36 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:36 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:36 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:05:36 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:05:36 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:36 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:05:36 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:05:36 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:05:36 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : timing
        -path_type full
        -delay_type max
        -max_paths 1
        -report_by design
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:05:36 2025
****************************************
No paths.
1
icc2_shell> source scripts/power_planning.tcl
Error: unknown command 'create_io_pin' (CMD-005)
Information: script '/home/student/Documents/RTL2GDSII/ICCII/scripts/power_planning.tcl'
                stopped at line 16 due to error. (CMD-081)
Extended error info:

    while executing
"create_io_pin -net VDD -layer M1 -location {0 0}"
    (file "/home/student/Documents/RTL2GDSII/ICCII/scripts/power_planning.tcl" line 16)
 -- End Extended Error Info
icc2_shell> #######################################################################################
icc2_shell> ## Power-planning - To build Power Delivery Network (PDN)
icc2_shell> ## #####################################################################################
icc2_shell> #
icc2_shell> ############################################################################
icc2_shell> ### Step 1: to_create power/ground nets and to_connect power/ground nets :-
icc2_shell> ##############################################################################
icc2_shell> #to create power nets
icc2_shell> create_net -power {VDD}
Error: Net 'VDD' already exists. (DES-150)
0
icc2_shell> create_net -ground {VSS}
Error: Net 'VSS' already exists. (DES-150)
0
icc2_shell> ## to connect power/ground_nets
icc2_shell> create_io_pin -net VDD -layer M1 -location {0 0}
Error: unknown command 'create_io_pin' (CMD-005)
icc2_shell> create_io_pin -net VSS -layer M1 -location {0 5}
Error: unknown command 'create_io_pin' (CMD-005)
icc2_shell> #
icc2_shell> connect_pg_net -all_blocks -automatic
Information: Connecting to PG and tie pins in automatic mode. (MV-396)
****************************************
Report : Power/Ground Connection Summary
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:08:52 2025
****************************************
P/G net name                  P/G pin count(previous/current)
--------------------------------------------------------------------------------
Power net VDD                 0/103
Ground net VSS                0/103
--------------------------------------------------------------------------------
Information: connections of 206 power/ground pin(s) are created or changed. (MV-382)

1
icc2_shell> #################################################################################
icc2_shell> ### step 2: to create power and ground ring patterns
icc2_shell> #################################################################################
icc2_shell> ###
icc2_shell> #scenario1:
icc2_shell> create_pg_ring_pattern core_ring_pattern -horizontal_layer M7 -horizontal_width .4 -horizontal_spacing .3 -vertical_layer M8 -vertical_width .4 -vertical_spacing .3
Information: The command 'create_pg_ring_pattern' cleared the undo history. (UNDO-016)
Successfully create PG ring pattern core_ring_pattern.
icc2_shell> set_pg_strategy core_power_ring -core -pattern {{name : core_ring_pattern}{nets : {VDD VSS}}{offset : {.5 .5}}}
Successfully set PG strategy core_power_ring.
icc2_shell> compile_pg -strategies core_power_ring
[icc2-lic Thu Jun  5 11:08:53 2025] Command 'compile_pg' requires licenses
[icc2-lic Thu Jun  5 11:08:53 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:08:53 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:53 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:08:53 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:08:53 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:08:53 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:53 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:08:53 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:53 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:08:53 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:53 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:08:53 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:08:53 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:08:53 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:53 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:08:53 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:53 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:08:53 2025] Check-out of alternate set of keys directly with queueing was successful
Sanity check for inputs.
No strategy-level via rule is specified, the default rule will be applied.
Automatic PG net connection through connect_pg_net is disabled.
Updating PG strategies.
Updating strategy core_power_ring.
Loading library and design information.
Number of Standard Cells: 103
Number of Hard Macros: 0
Number of Pads: 0
Creating rings.
Creating via connection between strategies and existing shapes.
via connection runtime: 0 seconds.
Removing dangling/floating wire/vias after DRC check.
Start iteration 1:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias inside strategy core_power_ring.
Checking 8 stacked vias: 0% 100%
Finish removing all dangling or floating wires and vias.
Commiting wires and vias.
Committing wires takes 0.00 seconds.
Committing vias takes 0.00 seconds.
Committed 8 wires.
Committed 8 vias.
Committed 0 wires for via creation.
Overall PG creation runtime: 0 seconds.
Successfully compiled PG.
Overall runtime: 0 seconds.
1
icc2_shell> ###############################################################################
icc2_shell> ### step 3: to create pg mesh pattern
icc2_shell> ################################################################################
icc2_shell> create_pg_mesh_pattern mesh -layers { {{vertical_layer: M6}{width: .34} {spacing: interleaving}{pitch: 5} {offset: .5}} {{horizontal_layer: M7}{width: .38} {spacing: interleaving} {pitch: 5} {offset: .5}} {{vertical_layer: M8}{width: .38} {spacing: interleaving}{pitch: 5} {offset: .5}}}
Successfully create mesh pattern mesh.
1
icc2_shell> set_pg_strategy core_mesh -pattern { {pattern:mesh} {nets: VDD VSS}} -core -extension {stop: innermost_ring}
Successfully set PG strategy core_mesh.
icc2_shell> #set_pg_strategy core_mesh -pattern { {pattern:mesh} {nets: VDD VSS}} -core -extension {{{side: 1 2} {direction: L T} {stop: innermost_ring}}}
icc2_shell> compile_pg -strategies core_mesh
[icc2-lic Thu Jun  5 11:08:54 2025] Command 'compile_pg' requires licenses
[icc2-lic Thu Jun  5 11:08:54 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:08:54 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:08:54 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:54 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:08:54 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:08:54 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:54 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Check-out of alternate set of keys directly with queueing was successful
Sanity check for inputs.
No strategy-level via rule is specified, the default rule will be applied.
Automatic PG net connection through connect_pg_net is disabled.
Updating PG strategies.
Updating strategy core_mesh.
Loading library and design information.
Number of Standard Cells: 103
Number of Hard Macros: 0
Number of Pads: 0
Creating straps and vias in power plan.
Creating wire shapes for strategies core_mesh .
Creating wire shapes runtime: 0 seconds
Blockage cutting and DRC fixing for wire shapes for strategies core_mesh .
Check and fix DRC for 24 wires for strategy core_mesh.
Number of threads: 1
Number of partitions: 2
Direction of partitions: vertical
Number of wires: 16
Checking DRC for 16 wires: 0% 100%
Checking DRC for 8 wires: 0% 100%
Creating 24 wires after DRC fixing.
Wire DRC checking runtime 0.00 seconds.
Creating via shapes for strategies core_mesh .
Working on strategy core_mesh.
Number of detected intersections: 64
Total runtime of via shapes creation: 0 seconds
Check and fix DRC for 64 stacked vias for strategy core_mesh.
Checking DRC for 64 stacked vias:: 0% 100%
Runtime of via DRC checking for strategy core_mesh: 0.00 seconds.
Creating via connection between strategies and existing shapes.
Check and fix DRCs for 48 stacked vias.
Number of threads: 1
Number of partitions: 2
Direction of partitions: horizontal
Number of vias: 48
Checking DRC for 48 stacked vias:: 0% 100%
Via DRC checking runtime 0.00 seconds.
via connection runtime: 0 seconds.
Removing dangling/floating wire/vias after DRC check.
Start iteration 1:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias inside strategy core_mesh.
Checking 64 stacked vias: 0% 100%
Checking dangling/floating vias between strategies and existing shapes.
Checking 48 stacked vias: 0% 100%
Finish removing all dangling or floating wires and vias.
Commiting wires and vias.
Committing wires takes 0.00 seconds.
Committing vias takes 0.00 seconds.
Committed 24 wires.
Committed 112 vias.
Committed 0 wires for via creation.
Overall PG creation runtime: 0 seconds.
Successfully compiled PG.
Overall runtime: 0 seconds.
1
icc2_shell> ###################################################
icc2_shell> ###step 4 : to create std cell power rail pattern
icc2_shell> #######################################################
icc2_shell> create_pg_std_cell_conn_pattern std_cell_rail -layers {M1} -rail_width 0.06
Successfully create standard cell rail pattern std_cell_rail.
icc2_shell> set_pg_strategy rail_strat -core -pattern {{name: std_cell_rail} {nets: VDD VSS} }
Successfully set PG strategy rail_strat.
icc2_shell> compile_pg -strategies rail_strat
[icc2-lic Thu Jun  5 11:08:54 2025] Command 'compile_pg' requires licenses
[icc2-lic Thu Jun  5 11:08:54 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:08:54 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:08:54 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:54 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:08:54 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:08:54 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:54 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:08:54 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:08:54 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:08:54 2025] Check-out of alternate set of keys directly with queueing was successful
Sanity check for inputs.
No strategy-level via rule is specified, the default rule will be applied.
Automatic PG net connection through connect_pg_net is disabled.
Updating PG strategies.
Updating strategy rail_strat.
Loading library and design information.
Number of Standard Cells: 103
Number of Hard Macros: 0
Number of Pads: 0
Creating standard cell rails.
Creating standard cell rails for strategy rail_strat.
DRC checking and fixing for standard cell rail strategy rail_strat.
Number of threads: 1
Number of partitions: 2
Direction of partitions: horizontal
Number of wires: 12
Checking DRC for 12 wires: 0% 100%
Creating 12 wires after DRC fixing.
Wire DRC checking runtime 0.00 seconds.
Creating via connection between strategies and existing shapes.
Check and fix DRCs for 96 stacked vias.
Number of threads: 1
Number of partitions: 2
Direction of partitions: horizontal
Number of vias: 96
Checking DRC for 96 stacked vias:: 0% 100%
48 regular vias are not fixed
Via DRC checking runtime 1.00 seconds.
via connection runtime: 1 seconds.
Removing dangling/floating wire/vias after DRC check.
Start iteration 1:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias between strategies and existing shapes.
Checking 48 stacked vias: 0% 100%
Start iteration 2:
Checking potential dangling/floating power plan wires.
Checking dangling/floating vias between strategies and existing shapes.
Checking 48 stacked vias: 0% 100%
Finish removing all dangling or floating wires and vias.
Commiting wires and vias.
Committing wires takes 0.00 seconds.
Committing vias takes 0.00 seconds.
Committed 12 wires.
Committed 240 vias.
Committed 0 wires for via creation.
Overall PG creation runtime: 1 seconds.
Successfully compiled PG.
Overall runtime: 1 seconds.
1
icc2_shell> #connect_pg_net -all_blocks -automatic
icc2_shell> #compile_pg
icc2_shell> ##########################################################
icc2_shell> ### step 5 : To save block and Save lib
icc2_shell> #############################################################
icc2_shell> ## "save_block"  will save block as the deign name (full_adder.design) by default
icc2_shell> #
icc2_shell> save_block
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
Information: Saving block 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'
1
icc2_shell> save_lib
Saving library 'FULL_ADDER_8BIT_LIB'
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
1
icc2_shell> save_block -as FULL_ADD_8BIT_PowerPlan
Information: Saving 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design' to 'FULL_ADDER_8BIT_LIB:FULL_ADD_8BIT_PowerPlan.design'. (DES-028)
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
1
icc2_shell> save_lib
Saving library 'FULL_ADDER_8BIT_LIB'
Warning: No valid clocks available in mode 'default'. Setting clock frequency to 1 GHz. (POW-034)
1
icc2_shell> start_gui
icc2_shell> report_qor
[icc2-lic Thu Jun  5 11:09:48 2025] Command 'report_qor' requires licenses
[icc2-lic Thu Jun  5 11:09:48 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:09:48 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:09:48 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:09:48 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:09:48 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:09:48 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:09:48 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:09:48 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:09:48 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:09:48 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:09:48 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:09:48 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:09:48 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:09:48 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:09:48 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:09:48 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:09:48 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:09:48 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : qor
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:09:48 2025
****************************************



Cell Count
----------------------------------------
Hierarchical Cell Count:              0
Hierarchical Port Count:              0
Leaf Cell Count:                    103
Buf/Inv Cell Count:                   0
Buf Cell Count:                       0
Inv Cell Count:                       0
Combinational Cell Count:            77
   Single-bit Isolation Cell Count:                        0
   Multi-bit Isolation Cell Count:                         0
   Isolation Cell Banking Ratio:                           0.00%
   Single-bit Level Shifter Cell Count:                    0
   Multi-bit Level Shifter Cell Count:                     0
   Level Shifter Cell Banking Ratio:                       0.00%
   Single-bit ELS Cell Count:                              0
   Multi-bit ELS Cell Count:                               0
   ELS Cell Banking Ratio:                                 0.00%
Sequential Cell Count:               26
   Integrated Clock-Gating Cell Count:                     0
   Sequential Macro Cell Count:                            0
   Single-bit Sequential Cell Count:                       26
   Multi-bit Sequential Cell Count:                        0
   Sequential Cell Banking Ratio:                          0.00%
   BitsPerflop:                                            1.00
Macro Count:                          0
----------------------------------------


Area
----------------------------------------
Combinational Area:              129.36
Noncombinational Area:           179.43
Buf/Inv Area:                      0.00
Total Buffer Area:                 0.00
Total Inverter Area:               0.00
Macro/Black Box Area:              0.00
Net Area:                             0
Net XLength:                     455.42
Net YLength:                     366.89
----------------------------------------
Cell Area (netlist):                            308.78
Cell Area (netlist and physical only):          308.79
Net Length:                      822.31


Design Rules
----------------------------------------
Total Number of Nets:               138
Nets with Violations:                 0
Max Trans Violations:                 0
Max Cap Violations:                   0
----------------------------------------

1
icc2_shell> report_timing
[icc2-lic Thu Jun  5 11:10:39 2025] Command 'report_timing' requires licenses
[icc2-lic Thu Jun  5 11:10:39 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:10:39 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:10:39 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:10:39 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:10:39 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:10:39 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:10:39 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:10:39 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:10:39 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:10:39 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:10:39 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:10:39 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:10:39 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:10:39 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:10:39 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:10:39 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:10:39 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:10:39 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : timing
        -path_type full
        -delay_type max
        -max_paths 1
        -report_by design
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:10:39 2025
****************************************
No paths.
1
icc2_shell> source scripts/placement.tcl
Created scenario func::nom for mode func and corner nom
All analysis types are activated.
Information: Timer using 1 threads
Warning: The 'set_max_fanout' command is not supported in this program.  The command will be ignored. (CSTR-011)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:FADDX1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:FADDX2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:HADDX1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:HADDX2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO21X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO21X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO221X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO221X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO222X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO222X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO22X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AO22X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AOBUFX1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:AOBUFX2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA21X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA21X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA221X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA221X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA222X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA222X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA22X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OA22X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OAI21X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:OAI21X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND2X0_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND2X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND2X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND2X4_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND3X0_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND3X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND3X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND3X4_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND4X0_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NAND4X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XOR2X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XOR2X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XOR3X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XOR3X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR2X0_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR2X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR2X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR2X4_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR3X0_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR3X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR3X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR3X4_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR4X0_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:NOR4X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XNOR2X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XNOR2X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XNOR3X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:XNOR3X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:MUX21X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:MUX21X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:MUX41X1_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
Information: The design specific attribute override for lib_cell 'saed32rvt_c:MUX41X2_RVT.timing' is set in the current block 'full_adder_8bit_v', because the actual library setting may not be overwritten. (ATTR-12)
[icc2-lic Thu Jun  5 11:11:55 2025] Command 'place_pins' requires licenses
[icc2-lic Thu Jun  5 11:11:55 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:11:55 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:11:55 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:11:55 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:11:55 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:11:55 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:11:55 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Check-out of alternate set of keys directly with queueing was successful
Information: Starting 'place_pins' (FLW-8000)
Information: Time: 2025-06-05 11:11:55 / Session:  00:07:06 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 594 MB (FLW-8100)
Load DB...
CPU Time for load db: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 

Min routing layer: M1
Max routing layer: MRDL


CPU Time for Top Level Pre-Route Processing: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
CPU Time for Leaf Level Pre-Route Processing: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Warning: found large number of corner keepout wiretracks on side 1 of block full_adder_8bit on layer M9 and there is no enough wire tracks available on this side (DPPA-096)
Warning: found large number of corner keepout wiretracks on side 2 of block full_adder_8bit on layer MRDL and there is no enough wire tracks available on this side (DPPA-096)
Warning: found large number of corner keepout wiretracks on side 3 of block full_adder_8bit on layer M9 and there is no enough wire tracks available on this side (DPPA-096)
Warning: found large number of corner keepout wiretracks on side 4 of block full_adder_8bit on layer MRDL and there is no enough wire tracks available on this side (DPPA-096)
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = MRDL
Turn off antenna since no rule is specified
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Cannot find a default contact code for layer CO. (ZRT-022)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)

Block Pin Constraint   Min Pin Max Pin Reserve
                       Layer   Layer   Layer    Feedthroughs
--------------------   ------  ------  ------   ------------
full_adder_8bit        M2      MRDL    MRDL     Not allowed

Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 3.55 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 3.55 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {0.001 23.456} {23.911 23.760} on layer M2. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {-1.368 0.001} {-1.064 22.391} on layer M3. (ZRT-625)
Warning: Master cell full_adder_8bit_v has duplicated redundant library pin shapes at {-1.368 0.001} {-1.064 22.391} on layer M3. (ZRT-625)
Note - message 'ZRT-625' limit (10) exceeded. Remainder will be suppressed.
Warning: Cell regB_reg[4] is placed overlapping with other cells at {{5.951 18.555} {9.903 20.227}}. (ZRT-763)
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used   52  Alloctr   53  Proc 4350 
Printing options for 'route.common.*'

Printing options for 'route.global.*'

Begin global routing.
Constructing data structure ...
Design statistics:
Design Bounding Box (-1.67um,-1.67um,25.58um,24.06um)
Number of routing layers = 10
layer M1, dir Hor, min width = 0.05um, min space = 0.05um pitch = 0.152um
layer M2, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.152um
layer M3, dir Hor, min width = 0.056um, min space = 0.056um pitch = 0.304um
layer M4, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.304um
layer M5, dir Hor, min width = 0.056um, min space = 0.056um pitch = 0.608um
layer M6, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.608um
layer M7, dir Hor, min width = 0.056um, min space = 0.056um pitch = 1.216um
layer M8, dir Ver, min width = 0.056um, min space = 0.056um pitch = 1.216um
layer M9, dir Hor, min width = 0.16um, min space = 0.16um pitch = 2.432um
layer MRDL, dir Ver, min width = 2um, min space = 2um pitch = 4.864um
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   57  Alloctr   57  Proc 4354 
Net statistics:
Total number of nets to route for block pin placement     = 29
Number of interface nets to route for block pin placement = 29
Number of single or zero port nets = 2
Net length statistics: 
Net Count(Ignore Fully Rted) 54, Total Half Perimeter Wire Length (HPWL) 683 microns
HPWL   0 ~   50 microns: Net Count       54     Total HPWL          683 microns
HPWL  50 ~  100 microns: Net Count        0     Total HPWL            0 microns
HPWL 100 ~  200 microns: Net Count        0     Total HPWL            0 microns
HPWL 200 ~  300 microns: Net Count        0     Total HPWL            0 microns
HPWL 300 ~  400 microns: Net Count        0     Total HPWL            0 microns
HPWL 400 ~  500 microns: Net Count        0     Total HPWL            0 microns
HPWL 500 ~  600 microns: Net Count        0     Total HPWL            0 microns
HPWL 600 ~  700 microns: Net Count        0     Total HPWL            0 microns
HPWL 700 ~  800 microns: Net Count        0     Total HPWL            0 microns
HPWL 800 ~  900 microns: Net Count        0     Total HPWL            0 microns
HPWL 900 ~ 1000 microns: Net Count        0     Total HPWL            0 microns
HPWL     > 1000 microns: Net Count        0     Total HPWL            0 microns
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    2 
[End of Build All Nets] Total (MB): Used   57  Alloctr   57  Proc 4356 
Number of partitions: 1 (1 x 1)
Size of partitions: 9 gCells x 9 gCells
Average gCell capacity  17.63    on layer (1)    M1
Average gCell capacity  17.78    on layer (2)    M2
Average gCell capacity  9.04     on layer (3)    M3
Average gCell capacity  8.93     on layer (4)    M4
Average gCell capacity  4.41     on layer (5)    M5
Average gCell capacity  4.11     on layer (6)    M6
Average gCell capacity  1.88     on layer (7)    M7
Average gCell capacity  2.01     on layer (8)    M8
Average gCell capacity  1.11     on layer (9)    M9
Average gCell capacity  0.44     on layer (10)   MRDL
Average number of tracks per gCell 18.89         on layer (1)    M1
Average number of tracks per gCell 20.00         on layer (2)    M2
Average number of tracks per gCell 9.56  on layer (3)    M3
Average number of tracks per gCell 10.11         on layer (4)    M4
Average number of tracks per gCell 4.89  on layer (5)    M5
Average number of tracks per gCell 5.11  on layer (6)    M6
Average number of tracks per gCell 2.56  on layer (7)    M7
Average number of tracks per gCell 2.67  on layer (8)    M8
Average number of tracks per gCell 1.33  on layer (9)    M9
Average number of tracks per gCell 0.67  on layer (10)   MRDL
Number of gCells = 810
Current Stage stats:
[End of Build Congestion Map] Elapsed real time: 0:00:00 
[End of Build Congestion Map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion Map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion Map] Total (MB): Used   57  Alloctr   58  Proc 4356 
Current Stage stats:
[End of Add Nets Demand] Elapsed real time: 0:00:00 
[End of Add Nets Demand] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Add Nets Demand] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Add Nets Demand] Total (MB): Used   57  Alloctr   58  Proc 4356 
Number of user frozen nets = 0
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    1  Alloctr    1  Proc    2 
[End of Build Data] Total (MB): Used   57  Alloctr   58  Proc 4356 
Number of partitions: 1 (1 x 1)
Size of partitions: 9 gCells x 9 gCells
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used   12  Alloctr   12  Proc   15 
[End of Blocked Pin Detection] Total (MB): Used   69  Alloctr   70  Proc 4372 
Information: Using 1 threads for routing. (ZRT-444)
Information: Buffer distance is estimated to be ~862.0000um (257 gCells)

Start GR phase 0
Number of partitions: 1 (1 x 1)
Size of partitions: 9 gCells x 9 gCells
[rtTop] Elapsed real time: 0:00:00 
[rtTop] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used   69  Alloctr   70  Proc 4372 
Initial. Routing result:
Initial. Both Dirs: Dmd-Cap  =     0 Max = 0 GRCs =     0 (0.00%)
Initial. H routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
Initial. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. MRDL       Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 233.92
Initial. Layer M1 wire length = 2.56
Initial. Layer M2 wire length = 76.74
Initial. Layer M3 wire length = 145.13
Initial. Layer M4 wire length = 9.49
Initial. Layer M5 wire length = 0.00
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Layer MRDL wire length = 0.00
Initial. Total Number of Contacts = 61
Initial. Via VIA12SQ_C count = 29
Initial. Via VIA23SQ_C count = 30
Initial. Via VIA34SQ_C count = 2
Initial. Via VIA45SQ_C count = 0
Initial. Via VIA56SQ_C count = 0
Initial. Via VIA67SQ_C count = 0
Initial. Via VIA78SQ_C count = 0
Initial. Via VIA89_C count = 0
Initial. Via VIA9RDL count = 0
Initial. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used   13  Alloctr   13  Proc   18 
[End of Whole Chip Routing] Total (MB): Used   69  Alloctr   70  Proc 4372 
[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used   12  Alloctr   13  Proc   18 
[End of Global Routing] Total (MB): Used   69  Alloctr   70  Proc 4372 
[End of dbOut] Elapsed real time: 0:00:00 
[End of dbOut] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of dbOut] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of dbOut] Total (MB): Used   60  Alloctr   61  Proc 4372 
CPU Time for Global Route: 00:00:00.07u 00:00:00.01s 00:00:00.07e: 
Number of block ports: 27
Number of block pin locations assigned from router: 27
CPU Time for Pin Preparation: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Number of PG ports on blocks: 0
Number of pins created: 27
CPU Time for Pin Creation: 00:00:00.00u 00:00:00.00s 00:00:00.00e: 
Total Pin Placement CPU Time: 00:00:00.07u 00:00:00.01s 00:00:00.08e: 
Information: Ending   'place_pins' (FLW-8001)
Information: Time: 2025-06-05 11:11:55 / Session:  00:07:06 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 654 MB (FLW-8100)
[icc2-lic Thu Jun  5 11:11:55 2025] Command 'place_opt' requires licenses
[icc2-lic Thu Jun  5 11:11:55 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:11:55 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:11:55 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:11:55 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:11:55 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:11:55 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:11:55 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:11:55 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:11:55 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:11:55 2025] Check-out of alternate set of keys directly with queueing was successful
Information: Starting 'place_opt' (FLW-8000)
Information: Time: 2025-06-05 11:11:55 / Session:  00:07:06 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 654 MB (FLW-8100)
INFO: place_opt is running in balanced flow mode
INFO: Total Power Aware Optimization Enabled (Dynamic + Leakage)
Information: Corner nom: no PVT mismatches. (PVT-032)
INFO: disable CRPR-based timing. 
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069356 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.077639 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (20000 20000) (219120 203920)
Number of VARs = 1
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 0
Blocked VAs: 
INFO: Running power improvement flow (1)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)

----------------------------------------------------------------------------------------------------------
Information: Starting place_opt / initial_place (FLW-8000)
Information: Time: 2025-06-05 11:11:56 / Session:  00:07:07 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 679 MB (FLW-8100)
----------------------------------------------------------------------------------------------------------


Information: Starting place_opt / initial_place / Initial Placement (FLW-8000)
Information: Time: 2025-06-05 11:11:56 / Session:  00:07:07 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 679 MB (FLW-8100)
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
************************************************************
Timer Settings:
Delay Calculation Style:                   auto
Signal Integrity Analysis:                 disabled
Timing Window Analysis:                    disabled
Advanced Waveform Propagation:             disabled
Variation Type:                            fixed_derate
Clock Reconvergence Pessimism Removal:     disabled
Advanced Receiver Model:                   disabled
LLE:                                       disabled
ML Acceleration:                           off
Smart Arc Optimization:                    disabled
************************************************************
Running merge clock gates
************************************************************
* CTS STEP: Clock Gate Merging
************************************************************
Setting for clock gate merging......
Setting all modes active.
Information: CTS will work on the following scenarios. (CTS-101)
   func::nom    (Mode: func; Corner: nom)
Information: CTS will work on all clocks in active scenarios, including 1 master clocks and 0 generated clocks. (CTS-107)
Output units used in this log:
   Time        : 1.00ns
   Resistance  : 1.00MOhm
   Capacitance : 1.00fF
   Power       : 1.00pW
   Length      : 1.00um
Information: Clock derating is enabled

CTS related app options set by user:
   No CTS related app option is set.

Collecting ICGs in clock trees......

Searching for equivalent ICGs......

Merging equivalent ICGs......

Clearing settings of clock gate merging......
Clearing enable all modes setting.

Information: Total 0 ICGs are not considered in merging for reasons: don't touch - 0; fixed - 0; other reasons - 0. (CTS-124)
 - message 'CTS-125' limit is (10).

Information: Total 0 ICGs are unique in the design. (CTS-126)
 - message 'CTS-127' limit is (10).

************************************************************
* CTS STEP: Summary
************************************************************
merge_clock_gates Statistics: Total
    ICG                       0
    Merged                    0
    Survived                  0
    Removed                   0
    ICG at the end            0


Summary of messages during CTS:
===============================================================
  Tag   Count  Type           Description
---------------------------------------------------------------
 No error or warning message.
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (20000 20000) (219120 203920)
Number of VARs = 1
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 0
Blocked VAs: 
INFO: sweep stats: 0 gates / 0 nets gobbled, 0 gates (0 seq) simplified
Running initial placement
----------------------------------------------------------------
running create_placement
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
CGRW: permuting timing equivalent pins only
Corner Scaling is off, multiplier is 1.000000
Information: timingScenario func::nom timingCorner nom.  Using corner nom for worst leakage corner. (OPT-078)
Information: Using default layer M4 (OPT-079)
Information: Nominal = 0.0285335  Design MT = 0.500000  Target = 0.1133189  MaxRC = 0.078167 Fast Target = 0.036930 (OPT-081)
nplLib: default vr hor dist = 898
nplLib: default vr ver dist = 898
nplLib: default vr buf size = 6
nplLib: default vr buf size = 2
Placer using max_unbuffered_distance = 897.69
Info: embedded eLpp will optimize for scenario func::nom
Information: Activity propagation will be performed for scenario func::nom.
Information: Doing activity propagation for mode 'func' and corner 'nom' with effort level 'medium'. (POW-024)
Information: Timer-derived activity data is cached on scenario func::nom (POW-052)
Information: Running switching activity propagation in scalar mode!

 **** Information : No. of simulation cycles = 6 ****
Info: e-eLpp used with low effort

Placement Options:
Effort:                        high_effort         
Timing Driven:                 true                
Buffering Aware Timing Driven: true                
Seed locs:                     false               
Incremental:                   false               
Congestion:                    false               
Fix Macros:                    true                
Place Macros:                  false               
Channel Size Macros:           false               

Printing options for 'place.coarse.*' (non-default only)
place.coarse.continue_on_missing_scandef                :        true                
place.coarse.fix_cells_on_soft_blockages                :        true                

Start transferring placement data.
****** eLpp estimated wire length 
12.0151% of the net wire length are clock nets
0% of the clock net wire length has no activity
Clock net wire length: 890142
Total net wire length: 7.4085e+06
****** eLpp weights (no caps) (no lengths)
Number of nets: 134, of which 133 non-clock nets
Number of nets with 0 toggle rate: 0 (0%)
Max toggle rate = 1, average toggle rate = 0.073579
Max non-clock toggle rate = 0.138306
eLpp weight range = (0.60472, 13.5908)
*** 4 nets are filtered out
****** Net weight manager: report ******
Weights included: eLpp  PostEffort  
Number of nets with non-default weights: 134
Amt power = 0.1
Non-default weight range: (0.960472, 6.25908)
                             Min         Max         Avg       Stdev        Skew
       Toggle Rates    0.0444946           1    0.073579   0.0847903     9.75993
      Power Weights      0.60472     13.5908           1     1.15237     9.75993
      Final Weights     0.960472     6.25908     1.02985    0.454929     11.3323
Information: Automatic repeater spreading is enabled.
Restructuring in 1 hierarchies
CGRW: importing permutable pins & pairs, size 8 and above
Information: Automatic timing control is enabled.
checking app option clockgate_objective_weight : none
Information: Clock gate latency aware placement is enabled. (PLACE-085)
Using worst RC corner 'nom' for buffer aware analysis.
DTDP placement: scenario=func::nom
Factor(1) = 1
Factor(BASE) = 1
Information: The net parasitics of block full_adder_8bit are cleared. (TIM-123)
Completed transferring placement data.
Running placement using 1 thread(s)
Information: Enhanced Auto Density Control is used. (PLACE-098)
Information: Enhanced auto density configuration is 13179.
Information: Automatic density control has selected the following settings: max_density 0.60, congestion_driven_max_util 0.87. (PLACE-027)
Information: HFW control 'on' invoked.
Creating placement from scratch.
coarse place 0% done.
Selected 26 sequential cells for slack balancing.
coarse place 14% done.
coarse place 29% done.
coarse place 43% done.
coarse place 57% done.
coarse place 71% done.
coarse place 86% done.
coarse place 100% done.
Information: Coarse placer wire length estimate = 721.836
Information: Coarse placer active wire length estimate = 117.603
Information: Coarse placer weighted wire length estimate = 1068.36
Information: Extraction observers are detached as design net change threshold is reached.
Stored 0 bounds for preserving balanced registers 
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)
START_CMD: optimize_dft        CPU:     44 s ( 0.01 hr) ELAPSE:    430 s ( 0.12 hr) MEM-PEAK:   752 Mb Thu Jun  5 11:11:59 2025
END_CMD: optimize_dft          CPU:     44 s ( 0.01 hr) ELAPSE:    430 s ( 0.12 hr) MEM-PEAK:   752 Mb Thu Jun  5 11:11:59 2025
----------------------------------------------------------------
Information: Ending   place_opt / initial_place / Initial Placement (FLW-8001)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:09 / Command:  00:00:03 / CPU:  00:00:03 / Memory: 752 MB (FLW-8100)


Information: Ending   place_opt / initial_place (FLW-8001)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:09 / Command:  00:00:03 / CPU:  00:00:03 / Memory: 752 MB (FLW-8100)

----------------------------------------------------------------------------------------------------------
Information: Starting place_opt / initial_drc (FLW-8000)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:09 / Command:  00:00:03 / CPU:  00:00:03 / Memory: 752 MB (FLW-8100)
----------------------------------------------------------------------------------------------------------


Information: Starting place_opt / initial_drc / High Fanout Synthesis (FLW-8000)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:09 / Command:  00:00:03 / CPU:  00:00:03 / Memory: 752 MB (FLW-8100)
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069412 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.078122 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Running initial HFS and DRC step.
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0139 seconds to build cellmap data
INFO: creating 3(r) x 3(c) GridCells YDim 8.36 XDim 8.36
INFO: number of GridCells (full_adder_8bit_v): 9
INFO: creating 3(r) x 3(c) GridCells YDim 8.36 XDim 8.36
INFO: number of GridCells (full_adder_8bit_v): 9
Total 0.0012 seconds to load 103 cell instances into cellmap, 103 cells are off site row
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells
Information: Current block utilization is '0.84320', effective utilization is '0.84316'. (OPT-055)

    Scenario func::nom  WNS = 0.000000, TNS = 0.000000, NVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK   
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY  
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- ---------
      0:07:10     0.000     0.000   308.785     0.000     0.000         0         0         0     0.000       752 

APSINFO: No multi-Vth libcells found, turning off percentage LVT optimization flow
APS-CHARZ: Performing leakage analysis

    Processing cells .....10%.....20%.....30%.....40%.....50%.....60%.....70%.....80%.....90%.....100%
INFO: sweep stats: 0 gates / 2 nets gobbled, 0 gates (0 seq) simplified
Isolated 0 ports, skipped 0 ports
Already Isolated 0 ports, Deleted 0 existing Isolation cells 

    Processing cells .....10%.....20%.....30%.....40%.....50%.....60%.....70%.....80%.....90%.....100%

    Scenario func::nom  WNS = 0.000000, TNS = 0.000000, NVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK   
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY  
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- ---------
      0:07:10     0.000     0.000   308.785     0.000     0.000         0         0         0     0.000       801 

Corner Scaling is off, multiplier is 1.000000

    Scenario func::nom  WNS = 0.000000, TNS = 0.000000, NVP = 0
    Scenario func::nom  WNHS = 0.000000, TNHS = 0.000000, NHVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK     MIN DELAY 
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY       COST   
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- -----------
      0:07:10     0.000     0.000   308.785     0.000     0.000         0         0         0     0.000       811     0.000

Information: timingScenario func::nom timingCorner nom.  Using corner nom for worst leakage corner. (OPT-078)
Information: Using default layer M4 (OPT-079)
Information: Nominal = 0.0285335  Design MT = 0.500000  Target = 0.1133189  MaxRC = 0.078167 Fast Target = 0.036930 (OPT-081)
Collecting Drivers ...  
Design max_transition = 0.500
Design max_capacitance = inf
Using layer M4 for buffering distances
GRE layer bins: None, M2
Running clock data isolation flow.
Found 0 buffer-tree drivers
No violators found
Running tristate isolation flow.
TSI: added 0 repeaters
Running mv isolation flow.
Found 0 buffer-tree drivers
No violators found
Found 0 buffer-tree drivers
No violators found
Zbuf-RUNTIME (Hr:Min:Sec)  CPU 0 hr : 0 min : 0.04 sec ELAPSE 0 hr : 0 min : 0.04 sec
Zbuf-RUNTIME         (Min) CPU 0 min ELAPSE 0 min
ZBuf-MEM(max-mem) total 0 K / inuse 0 K

    Scenario func::nom  WNS = 0.000000, TNS = 0.000000, NVP = 0
    Scenario func::nom  WNHS = 0.000000, TNHS = 0.000000, NHVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK     MIN DELAY 
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY       COST   
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- -----------
      0:07:10     0.000     0.000   308.785     0.000     0.000         0         0         0     0.000       824     0.000


    Scenario func::nom  WNS = 0.000000, TNS = 0.000000, NVP = 0
    Scenario func::nom  WNHS = 0.000000, TNHS = 0.000000, NHVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK     MIN DELAY 
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY       COST   
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- -----------
      0:07:10     0.000     0.000   308.785     0.000     0.000         0         0         0     0.000       824     0.000

Information: Ending   place_opt / initial_drc / High Fanout Synthesis (FLW-8001)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:10 / Command:  00:00:04 / CPU:  00:00:04 / Memory: 824 MB (FLW-8100)


Information: Ending   place_opt / initial_drc (FLW-8001)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:10 / Command:  00:00:04 / CPU:  00:00:04 / Memory: 824 MB (FLW-8100)

----------------------------------------------------------------------------------------------------------
Information: Starting place_opt / initial_opto (FLW-8000)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:10 / Command:  00:00:04 / CPU:  00:00:04 / Memory: 824 MB (FLW-8100)
----------------------------------------------------------------------------------------------------------


Information: Starting place_opt / initial_opto / Optimization (FLW-8000)
Information: Time: 2025-06-05 11:11:59 / Session:  00:07:10 / Command:  00:00:04 / CPU:  00:00:04 / Memory: 824 MB (FLW-8100)

Information: The net parasitics of block full_adder_8bit are cleared. (TIM-123)
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069412 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.078122 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (20000 20000) (219120 203920)
Number of VARs = 1
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 0
Blocked VAs: 
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

    Scenario func::nom  WNS = 0.000000, TNS = 0.000000, NVP = 0

     ELAPSED  WORST NEG TOTAL NEG              MAX       MAX     BUFFER    INVERTER   LVTH      LVTH      PEAK   
      TIME      SLACK     SLACK     AREA    TRAN COST CAP COST    COUNT     COUNT     COUNT    PERCENT   MEMORY  
    --------- --------- --------- --------- --------- --------- --------- --------- --------- --------- ---------
      0:07:10     0.000     0.000   308.785     0.000     0.000         0         0         0     0.000       824 

Running initial optimization step.
Place-opt command begin                   CPU:    31 s (  0.01 hr )  ELAPSE:   431 s (  0.12 hr )  MEM-PEAK:   824 MB
Info: update em.

Place-opt timing update complete          CPU:    31 s (  0.01 hr )  ELAPSE:   431 s (  0.12 hr )  MEM-PEAK:   824 MB
INFO: Propagating Switching Activities
Information: Activity for scenario func::nom was cached, no propagation required. (POW-005)
INFO: Switching Activity propagation took     0.00001 sec
INFO: Propagating Switching Activity for all power flows 

Place-opt initial QoR
_____________________
Scenario Mapping Table
1: func::nom

Pathgroup Mapping Table
1: **default**
2: **async_default**
3: **clock_gating_default**
4: **in2reg_default**
5: **reg2out_default**
6: **in2out_default**
7: Clock

-------------------------------------------------------------------------------------------------------------------------------------------------------------
PATHGROUP QOR 
-------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV
    1   1   0.0000     0.0000      0        -          -      -
    1   2   0.0000     0.0000      0        -          -      -
    1   3   0.0000     0.0000      0        -          -      -
    1   4   0.0000     0.0000      0        -          -      -
    1   5   0.0000     0.0000      0        -          -      -
    1   6   0.0000     0.0000      0        -          -      -
    1   7   0.0000     0.0000      0        -          -      -
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
SCENARIO QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage
    1   *   0.0000     0.0000   0.0000      0        -          -      -        0     0.0000        0  629884736
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
DESIGN QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage         Area    InstCnt     BufCnt     InvCnt
    *   *   0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0     0.0000        0  629884736       308.78        103          0          0
----------------------------------------------------------------------------------------------------------------------------------------------------------------------

Place-opt initial QoR Summary       WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV  MaxCapV    Leakage         Area    InstCnt
Place-opt initial QoR Summary    0.0000     0.0000   0.0000      0   0.0000     0.0000      0        0        0  629884736       308.78        103
Information: The netlist change observers are disabled for incremental extraction. (TIM-126)
INFO: using 1 threads
Place-opt initialization complete         CPU:    32 s (  0.01 hr )  ELAPSE:   431 s (  0.12 hr )  MEM-PEAK:   824 MB
Place-opt optimization summary            SETUP-COST    R2R-COST HOLD-COST LDRC-COST          AREA     LEAKAGE     INSTCNT            ELAPSE       MEM
Information: The netlist change observers are enabled for incremental extraction. (TIM-127)

Place-opt optimization Phase 15 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       824

Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0087 seconds to build cellmap data
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
Total 0.0013 seconds to load 103 cell instances into cellmap, 103 cells are off site row
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells
Place-opt optimization Phase 16 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       824

Place-opt optimization Phase 17 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       824

Place-opt optimization Phase 18 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       824
INFO: New Levelizer turned on
Place-opt optimization Phase 18 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       824
Place-opt optimization Phase 18 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       824

Multi-thread GR for layer opto ...
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    7  Alloctr    7  Proc 4543 
Printing options for 'route.common.*'

Printing options for 'route.global.*'
global.deterministic                                    :        on                  
global.timing_driven                                    :        false               

Begin global routing.
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = MRDL
Turn off antenna since no rule is specified
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Cannot find a default contact code for layer CO. (ZRT-022)
Warning: Port VDD of cell full_adder_8bit_v is unplaced.  This may impact routing result. (ZRT-740)
Warning: Port VSS of cell full_adder_8bit_v is unplaced.  This may impact routing result. (ZRT-740)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Information: Via ladder engine would be activated for pattern must join connection in certain commands. Please refer to man-page for the command list. (ZRT-619)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 3.55 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 3.55 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Cell U92 is placed overlapping with other cells at {{6.824 3.652} {7.736 5.324}}. (ZRT-763)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:00 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Read DB] Stage (MB): Used   22  Alloctr   22  Proc    0 
[End of Read DB] Total (MB): Used   29  Alloctr   30  Proc 4543 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00um,0.00um,23.91um,22.39um)
Number of routing layers = 10
layer M1, dir Hor, min width = 0.05um, min space = 0.05um pitch = 0.152um
layer M2, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.152um
layer M3, dir Hor, min width = 0.056um, min space = 0.056um pitch = 0.304um
layer M4, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.304um
layer M5, dir Hor, min width = 0.056um, min space = 0.056um pitch = 0.608um
layer M6, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.608um
layer M7, dir Hor, min width = 0.056um, min space = 0.056um pitch = 1.216um
layer M8, dir Ver, min width = 0.056um, min space = 0.056um pitch = 1.216um
layer M9, dir Hor, min width = 0.16um, min space = 0.16um pitch = 2.432um
layer MRDL, dir Ver, min width = 2um, min space = 2um pitch = 4.864um
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   30  Alloctr   30  Proc 4543 
Net statistics:
Total number of nets     = 136
Number of nets to route  = 136
Net length statistics: 
Net Count(Ignore Fully Rted) 136, Total Half Perimeter Wire Length (HPWL) 925 microns
HPWL   0 ~   50 microns: Net Count      136     Total HPWL          925 microns
HPWL  50 ~  100 microns: Net Count        0     Total HPWL            0 microns
HPWL 100 ~  200 microns: Net Count        0     Total HPWL            0 microns
HPWL 200 ~  300 microns: Net Count        0     Total HPWL            0 microns
HPWL 300 ~  400 microns: Net Count        0     Total HPWL            0 microns
HPWL 400 ~  500 microns: Net Count        0     Total HPWL            0 microns
HPWL 500 ~  600 microns: Net Count        0     Total HPWL            0 microns
HPWL 600 ~  700 microns: Net Count        0     Total HPWL            0 microns
HPWL 700 ~  800 microns: Net Count        0     Total HPWL            0 microns
HPWL 800 ~  900 microns: Net Count        0     Total HPWL            0 microns
HPWL 900 ~ 1000 microns: Net Count        0     Total HPWL            0 microns
HPWL     > 1000 microns: Net Count        0     Total HPWL            0 microns
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   30  Alloctr   31  Proc 4543 
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
Average gCell capacity  3.88     on layer (1)    M1
Average gCell capacity  10.23    on layer (2)    M2
Average gCell capacity  5.38     on layer (3)    M3
Average gCell capacity  5.13     on layer (4)    M4
Average gCell capacity  2.70     on layer (5)    M5
Average gCell capacity  2.07     on layer (6)    M6
Average gCell capacity  1.08     on layer (7)    M7
Average gCell capacity  1.09     on layer (8)    M8
Average gCell capacity  0.62     on layer (9)    M9
Average gCell capacity  0.21     on layer (10)   MRDL
Average number of tracks per gCell 11.38         on layer (1)    M1
Average number of tracks per gCell 11.29         on layer (2)    M2
Average number of tracks per gCell 5.77  on layer (3)    M3
Average number of tracks per gCell 5.71  on layer (4)    M4
Average number of tracks per gCell 3.00  on layer (5)    M5
Average number of tracks per gCell 2.93  on layer (6)    M6
Average number of tracks per gCell 1.54  on layer (7)    M7
Average number of tracks per gCell 1.50  on layer (8)    M8
Average number of tracks per gCell 0.85  on layer (9)    M9
Average number of tracks per gCell 0.43  on layer (10)   MRDL
Number of gCells = 1820
Current Stage stats:
[End of Build Congestion Map] Elapsed real time: 0:00:00 
[End of Build Congestion Map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion Map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion Map] Total (MB): Used   30  Alloctr   31  Proc 4543 
Current Stage stats:
[End of Add Nets Demand] Elapsed real time: 0:00:00 
[End of Add Nets Demand] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Add Nets Demand] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Add Nets Demand] Total (MB): Used   30  Alloctr   31  Proc 4543 
Number of user frozen nets = 0
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Data] Total (MB): Used   30  Alloctr   31  Proc 4543 
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used  104  Alloctr  104  Proc  101 
[End of Blocked Pin Detection] Total (MB): Used  134  Alloctr  135  Proc 4644 
Information: Using 1 threads for routing. (ZRT-444)
Information: Placement fast mode ON
Information: Multiple gcell levels ON
Information: Buffer distance is estimated to be ~862.0000um (515 gCells)

Start GR phase 0
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
[rtAllBotParts] Elapsed real time: 0:00:00 
[rtAllBotParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[rtTop] Elapsed real time: 0:00:00 
[rtTop] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used  134  Alloctr  135  Proc 4644 
Initial. Routing result:
Initial. Both Dirs: Dmd-Cap  =     0 Max = 0 GRCs =     0 (0.00%)
Initial. H routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. Both Dirs: Overflow =     2 Max = 2 GRCs =     8 (2.20%)
Initial. H routing: Overflow =     1 Max = 2 (GRCs =  1) GRCs =     5 (2.75%)
Initial. V routing: Overflow =     1 Max = 1 (GRCs =  3) GRCs =     3 (1.65%)
Initial. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M2         Overflow =     1 Max = 1 (GRCs =  3) GRCs =     3 (1.65%)
Initial. M3         Overflow =     1 Max = 2 (GRCs =  1) GRCs =     5 (2.75%)
Initial. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. MRDL       Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 687.39
Initial. Layer M1 wire length = 4.53
Initial. Layer M2 wire length = 311.20
Initial. Layer M3 wire length = 359.57
Initial. Layer M4 wire length = 12.08
Initial. Layer M5 wire length = 0.00
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Layer MRDL wire length = 0.00
Initial. Total Number of Contacts = 514
Initial. Via VIA12SQ_C count = 306
Initial. Via VIA23SQ_C count = 206
Initial. Via VIA34SQ_C count = 2
Initial. Via VIA45SQ_C count = 0
Initial. Via VIA56SQ_C count = 0
Initial. Via VIA67SQ_C count = 0
Initial. Via VIA78SQ_C count = 0
Initial. Via VIA89_C count = 0
Initial. Via VIA9RDL count = 0
Initial. completed.

Start GR phase 1
Thu Jun  5 11:12:00 2025
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
[rtAllParts] Elapsed real time: 0:00:00 
[rtAllParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[updNetsDmd] Elapsed real time: 0:00:00 
[updNetsDmd] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used  134  Alloctr  135  Proc 4644 
phase1. Routing result:
phase1. Both Dirs: Dmd-Cap  =     0 Max = 0 GRCs =     0 (0.00%)
phase1. H routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. V routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. Both Dirs: Overflow =     0 Max = 0 GRCs =     0 (0.00%)
phase1. H routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M1         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. MRDL       Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 689.48
phase1. Layer M1 wire length = 5.77
phase1. Layer M2 wire length = 300.96
phase1. Layer M3 wire length = 340.60
phase1. Layer M4 wire length = 26.08
phase1. Layer M5 wire length = 16.07
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Layer MRDL wire length = 0.00
phase1. Total Number of Contacts = 531
phase1. Via VIA12SQ_C count = 308
phase1. Via VIA23SQ_C count = 205
phase1. Via VIA34SQ_C count = 12
phase1. Via VIA45SQ_C count = 6
phase1. Via VIA56SQ_C count = 0
phase1. Via VIA67SQ_C count = 0
phase1. Via VIA78SQ_C count = 0
phase1. Via VIA89_C count = 0
phase1. Via VIA9RDL count = 0
phase1. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used  105  Alloctr  105  Proc  101 
[End of Whole Chip Routing] Total (MB): Used  134  Alloctr  135  Proc 4644 

Congestion utilization per direction:
Average vertical track utilization   = 12.84 %
Peak    vertical track utilization   = 57.14 %
Average horizontal track utilization = 12.42 %
Peak    horizontal track utilization = 54.55 %

[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used  105  Alloctr  105  Proc  101 
[End of Global Routing] Total (MB): Used  134  Alloctr  135  Proc 4644 
Writing out congestion map...
Updating congestion ...
Updating congestion ...
[End of dbOut] Elapsed real time: 0:00:00 
[End of dbOut] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of dbOut] Stage (MB): Used  -21  Alloctr  -21  Proc    0 
[End of dbOut] Total (MB): Used   36  Alloctr   37  Proc 4644 
Convert timing mode ...
Place-opt optimization Phase 19 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  4         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Number of Site types in the design = 1
INFO: Skipping activation of hold scenarios prior to CUS.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Information: CTS will work on the following scenarios. (CTS-101)
Information: CTS will work on all clocks in active scenarios, including 1 master clocks and 0 generated clocks. (CTS-107)
Information: 'nom' is identified as primary corner for initial clock tree building. (CTS-103)
CCD app option: ccd.targeted_ccd_path_groups:  **clock_gating_default**
Target path group: scenario func::nom pathgroup **clock_gating_default**
Information: CCD will use corner nom for honoring max prepone/postpone limits

Summary of messages during CTS:
===============================================================
  Tag   Count  Type           Description
---------------------------------------------------------------
 No error or warning message.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)
INFO: Skipping deactivation of hold scenarios after CUS.
Number of Site types in the design = 1
Corner Scaling is off, multiplier is 1.000000
Information: Using default layer M4 (OPT-079)
bmap: stepx = stepy = 83600
creating bmap
DB units per micron : 10000
Place-opt optimization Phase 19 Iter  5         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  6         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  7         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  8         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter  9         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 10         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 11         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 12         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Number of Site types in the design = 1
INFO: Skipping activation of hold scenarios prior to CUS.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Information: CTS will work on the following scenarios. (CTS-101)
Information: CTS will work on all clocks in active scenarios, including 1 master clocks and 0 generated clocks. (CTS-107)
Information: 'nom' is identified as primary corner for initial clock tree building. (CTS-103)
CCD app option: ccd.targeted_ccd_path_groups:  **clock_gating_default**
Target path group: scenario func::nom pathgroup **clock_gating_default**
Information: CCD will use corner nom for honoring max prepone/postpone limits

Summary of messages during CTS:
===============================================================
  Tag   Count  Type           Description
---------------------------------------------------------------
 No error or warning message.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)
INFO: Skipping deactivation of hold scenarios after CUS.
Number of Site types in the design = 1
Place-opt optimization Phase 19 Iter 13         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 14         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 15         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 16         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 17         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization Phase 19 Iter 18         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925

Place-opt optimization Phase 20 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925

Disable clock slack update for ideal clocks
Place-opt optimization Phase 21 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
INFO: cellmap features:  adv-rules=(N), pdc=(N), clock-rules=(Y)

Place-opt optimization Phase 22 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Place-opt optimization summary            SETUP-COST    R2R-COST HOLD-COST LDRC-COST          AREA     LEAKAGE     INSTCNT            ELAPSE       MEM
Place-opt optimization Phase 22 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Warning: Restoring scoped app option 'xform.commit_density_threshold' to original value 'unset' (from current value '1', which is different from the scoped value '1.0'). (FLW-2892)
Warning: Restoring scoped app option 'opt.internal.levfilter_arec_slack' to original value 'unset' (from current value '-1', which is different from the scoped value '-1.0'). (FLW-2892)

Place-opt optimization Phase 23 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
INFO: New Levelizer turned on

Disable clock slack update for ideal clocks
Information: Activity for scenario func::nom was cached, no propagation required. (POW-005)
Place-opt optimization Phase 24 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
INFO: cellmap features:  adv-rules=(N), pdc=(N), clock-rules=(Y)

Place-opt optimization Phase 25 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
INFO: New Levelizer turned on

Place-opt optimization Phase 26 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925


Information: Ending   place_opt / initial_opto / Optimization (FLW-8001)
Information: Time: 2025-06-05 11:12:01 / Session:  00:07:12 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 926 MB (FLW-8100)

Place-opt optimization Phase 29 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925

Information: Ending   place_opt / initial_opto (FLW-8001)
Information: Time: 2025-06-05 11:12:01 / Session:  00:07:12 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 926 MB (FLW-8100)

----------------------------------------------------------------------------------------------------------
Information: Starting place_opt / final_place (FLW-8000)
Information: Time: 2025-06-05 11:12:01 / Session:  00:07:12 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 926 MB (FLW-8100)
----------------------------------------------------------------------------------------------------------


Information: Starting place_opt / final_place / Timing and Congestion Driven Placement with Legalization (FLW-8000)
Information: Time: 2025-06-05 11:12:01 / Session:  00:07:12 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 926 MB (FLW-8100)
Place-opt optimization Phase 33 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12       925
Running final (timing-driven) placement step.
----------------------------------------------------------------
Running congestion-aware direct-timing-driven placement
Information: Disabling integrated legalization, because it requires that the advanced legalizer is enabled.
Start transferring placement data.
Warning: To enable pin track alignment feature, the advanced legalizer has to be turned on using app option "place.legalize.enable_advanced_legalizer".
Warning: Pin track alignment feature will be disabled in this run
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0084 seconds to build cellmap data
Information: Extraction observers are detached as design net change threshold is reached.
Snapped 103 standard cells to the nearest cellrow to improve the accuracy of congestion analysis.
Start Global Route ... 
[Init] Elapsed real time: 0:00:00 
[Init] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[Init] Stage (MB): Used    0  Alloctr    0  Proc    0 
[Init] Total (MB): Used    7  Alloctr    7  Proc 4644 
Printing options for 'route.common.*'

Printing options for 'route.global.*'
global.deterministic                                    :        on                  
global.timing_driven                                    :        false               

Begin global routing.
Cell Min-Routing-Layer = M1
Cell Max-Routing-Layer = MRDL
Turn off antenna since no rule is specified
Information: Option route.detail.force_end_on_preferred_grid will be ignored since none of the layers have preferred grid. (ZRT-703)
Warning: Cannot find a default contact code for layer CO. (ZRT-022)
Warning: Port VDD of cell full_adder_8bit_v is unplaced.  This may impact routing result. (ZRT-740)
Warning: Port VSS of cell full_adder_8bit_v is unplaced.  This may impact routing result. (ZRT-740)
Warning: Ignore 2 top cell ports with no pins. (ZRT-027)
Info: number of net_type_blockage: 0 
Information: Via ladder engine would be activated for pattern must join connection in certain commands. Please refer to man-page for the command list. (ZRT-619)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 3.55 outside the layer range. (ZRT-707)
Information: When applicable Min-max layer allow_pin_connection mode will allow paths of length 3.55 outside the layer range on clock nets. (ZRT-718)
Information: When applicable layer based tapering will taper up to 0.00 in distance from the pin. (ZRT-706)
Warning: Cell SUM_reg[1] is placed overlapping with other cells at {{17.808 12.032} {21.760 13.704}}. (ZRT-763)
Current Stage stats:
[End of Read DB] Elapsed real time: 0:00:00 
[End of Read DB] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Read DB] Stage (MB): Used   22  Alloctr   22  Proc    0 
[End of Read DB] Total (MB): Used   29  Alloctr   30  Proc 4644 
Constructing data structure ...
Design statistics:
Design Bounding Box (0.00um,0.00um,23.91um,22.39um)
Number of routing layers = 10
layer M1, dir Hor, min width = 0.05um, min space = 0.05um pitch = 0.152um
layer M2, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.152um
layer M3, dir Hor, min width = 0.056um, min space = 0.056um pitch = 0.304um
layer M4, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.304um
layer M5, dir Hor, min width = 0.056um, min space = 0.056um pitch = 0.608um
layer M6, dir Ver, min width = 0.056um, min space = 0.056um pitch = 0.608um
layer M7, dir Hor, min width = 0.056um, min space = 0.056um pitch = 1.216um
layer M8, dir Ver, min width = 0.056um, min space = 0.056um pitch = 1.216um
layer M9, dir Hor, min width = 0.16um, min space = 0.16um pitch = 2.432um
layer MRDL, dir Ver, min width = 2um, min space = 2um pitch = 4.864um
Current Stage stats:
[End of Build Tech Data] Elapsed real time: 0:00:00 
[End of Build Tech Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Tech Data] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Tech Data] Total (MB): Used   30  Alloctr   30  Proc 4644 
Net statistics:
Total number of nets     = 136
Number of nets to route  = 136
Net length statistics: 
Net Count(Ignore Fully Rted) 136, Total Half Perimeter Wire Length (HPWL) 941 microns
HPWL   0 ~   50 microns: Net Count      136     Total HPWL          941 microns
HPWL  50 ~  100 microns: Net Count        0     Total HPWL            0 microns
HPWL 100 ~  200 microns: Net Count        0     Total HPWL            0 microns
HPWL 200 ~  300 microns: Net Count        0     Total HPWL            0 microns
HPWL 300 ~  400 microns: Net Count        0     Total HPWL            0 microns
HPWL 400 ~  500 microns: Net Count        0     Total HPWL            0 microns
HPWL 500 ~  600 microns: Net Count        0     Total HPWL            0 microns
HPWL 600 ~  700 microns: Net Count        0     Total HPWL            0 microns
HPWL 700 ~  800 microns: Net Count        0     Total HPWL            0 microns
HPWL 800 ~  900 microns: Net Count        0     Total HPWL            0 microns
HPWL 900 ~ 1000 microns: Net Count        0     Total HPWL            0 microns
HPWL     > 1000 microns: Net Count        0     Total HPWL            0 microns
Current Stage stats:
[End of Build All Nets] Elapsed real time: 0:00:00 
[End of Build All Nets] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build All Nets] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build All Nets] Total (MB): Used   30  Alloctr   31  Proc 4644 
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
Average gCell capacity  3.73     on layer (1)    M1
Average gCell capacity  10.23    on layer (2)    M2
Average gCell capacity  5.38     on layer (3)    M3
Average gCell capacity  5.13     on layer (4)    M4
Average gCell capacity  2.70     on layer (5)    M5
Average gCell capacity  2.07     on layer (6)    M6
Average gCell capacity  1.08     on layer (7)    M7
Average gCell capacity  1.09     on layer (8)    M8
Average gCell capacity  0.62     on layer (9)    M9
Average gCell capacity  0.21     on layer (10)   MRDL
Average number of tracks per gCell 11.38         on layer (1)    M1
Average number of tracks per gCell 11.29         on layer (2)    M2
Average number of tracks per gCell 5.77  on layer (3)    M3
Average number of tracks per gCell 5.71  on layer (4)    M4
Average number of tracks per gCell 3.00  on layer (5)    M5
Average number of tracks per gCell 2.93  on layer (6)    M6
Average number of tracks per gCell 1.54  on layer (7)    M7
Average number of tracks per gCell 1.50  on layer (8)    M8
Average number of tracks per gCell 0.85  on layer (9)    M9
Average number of tracks per gCell 0.43  on layer (10)   MRDL
Number of gCells = 1820
Current Stage stats:
[End of Build Congestion Map] Elapsed real time: 0:00:00 
[End of Build Congestion Map] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Congestion Map] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Build Congestion Map] Total (MB): Used   30  Alloctr   31  Proc 4644 
Current Stage stats:
[End of Add Nets Demand] Elapsed real time: 0:00:00 
[End of Add Nets Demand] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Add Nets Demand] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Add Nets Demand] Total (MB): Used   30  Alloctr   31  Proc 4644 
Number of user frozen nets = 0
Total stats:
[End of Build Data] Elapsed real time: 0:00:00 
[End of Build Data] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Build Data] Stage (MB): Used    1  Alloctr    1  Proc    0 
[End of Build Data] Total (MB): Used   30  Alloctr   31  Proc 4644 
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
Current Stage stats:
[End of Blocked Pin Detection] Elapsed real time: 0:00:00 
[End of Blocked Pin Detection] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Blocked Pin Detection] Stage (MB): Used  104  Alloctr  104  Proc   80 
[End of Blocked Pin Detection] Total (MB): Used  134  Alloctr  135  Proc 4724 
Information: Using 1 threads for routing. (ZRT-444)
Information: Placement fast mode ON
Information: Multiple gcell levels ON
Information: Buffer distance is estimated to be ~862.0000um (515 gCells)

Start GR phase 0
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
[rtAllBotParts] Elapsed real time: 0:00:00 
[rtAllBotParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[rtTop] Elapsed real time: 0:00:00 
[rtTop] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Initial Routing] Elapsed real time: 0:00:00 
[End of Initial Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Initial Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Initial Routing] Total (MB): Used  134  Alloctr  135  Proc 4724 
Initial. Routing result:
Initial. Both Dirs: Dmd-Cap  =     0 Max = 0 GRCs =     0 (0.00%)
Initial. H routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. V routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. Both Dirs: Overflow =     3 Max = 1 GRCs =     3 (0.82%)
Initial. H routing: Overflow =     3 Max = 1 (GRCs =  3) GRCs =     3 (1.65%)
Initial. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M1         Overflow =     1 Max = 1 (GRCs =  1) GRCs =     1 (0.55%)
Initial. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M3         Overflow =     2 Max = 1 (GRCs =  2) GRCs =     2 (1.10%)
Initial. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
Initial. MRDL       Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

Initial. Total Wire Length = 699.66
Initial. Layer M1 wire length = 4.40
Initial. Layer M2 wire length = 326.35
Initial. Layer M3 wire length = 348.99
Initial. Layer M4 wire length = 19.92
Initial. Layer M5 wire length = 0.00
Initial. Layer M6 wire length = 0.00
Initial. Layer M7 wire length = 0.00
Initial. Layer M8 wire length = 0.00
Initial. Layer M9 wire length = 0.00
Initial. Layer MRDL wire length = 0.00
Initial. Total Number of Contacts = 509
Initial. Via VIA12SQ_C count = 305
Initial. Via VIA23SQ_C count = 198
Initial. Via VIA34SQ_C count = 6
Initial. Via VIA45SQ_C count = 0
Initial. Via VIA56SQ_C count = 0
Initial. Via VIA67SQ_C count = 0
Initial. Via VIA78SQ_C count = 0
Initial. Via VIA89_C count = 0
Initial. Via VIA9RDL count = 0
Initial. completed.

Start GR phase 1
Thu Jun  5 11:12:01 2025
Number of partitions: 1 (1 x 1)
Size of partitions: 14 gCells x 13 gCells
[rtAllParts] Elapsed real time: 0:00:00 
[rtAllParts] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[updNetsDmd] Elapsed real time: 0:00:00 
[updNetsDmd] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
Current Stage stats:
[End of Phase1 Routing] Elapsed real time: 0:00:00 
[End of Phase1 Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Phase1 Routing] Stage (MB): Used    0  Alloctr    0  Proc    0 
[End of Phase1 Routing] Total (MB): Used  134  Alloctr  135  Proc 4724 
phase1. Routing result:
phase1. Both Dirs: Dmd-Cap  =     0 Max = 0 GRCs =     0 (0.00%)
phase1. H routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. V routing: Dmd-Cap  =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. Both Dirs: Overflow =     1 Max = 1 GRCs =     1 (0.27%)
phase1. H routing: Overflow =     1 Max = 1 (GRCs =  1) GRCs =     1 (0.55%)
phase1. V routing: Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M1         Overflow =     1 Max = 1 (GRCs =  1) GRCs =     1 (0.55%)
phase1. M2         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M3         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M4         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M5         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M6         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M7         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M8         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. M9         Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)
phase1. MRDL       Overflow =     0 Max = 0 (GRCs =  0) GRCs =     0 (0.00%)

phase1. Total Wire Length = 699.66
phase1. Layer M1 wire length = 4.40
phase1. Layer M2 wire length = 323.04
phase1. Layer M3 wire length = 340.91
phase1. Layer M4 wire length = 23.23
phase1. Layer M5 wire length = 8.08
phase1. Layer M6 wire length = 0.00
phase1. Layer M7 wire length = 0.00
phase1. Layer M8 wire length = 0.00
phase1. Layer M9 wire length = 0.00
phase1. Layer MRDL wire length = 0.00
phase1. Total Number of Contacts = 513
phase1. Via VIA12SQ_C count = 305
phase1. Via VIA23SQ_C count = 198
phase1. Via VIA34SQ_C count = 8
phase1. Via VIA45SQ_C count = 2
phase1. Via VIA56SQ_C count = 0
phase1. Via VIA67SQ_C count = 0
phase1. Via VIA78SQ_C count = 0
phase1. Via VIA89_C count = 0
phase1. Via VIA9RDL count = 0
phase1. completed.
[End of Whole Chip Routing] Elapsed real time: 0:00:00 
[End of Whole Chip Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Whole Chip Routing] Stage (MB): Used  105  Alloctr  105  Proc   80 
[End of Whole Chip Routing] Total (MB): Used  134  Alloctr  135  Proc 4724 

Congestion utilization per direction:
Average vertical track utilization   = 12.40 %
Peak    vertical track utilization   = 64.29 %
Average horizontal track utilization = 11.92 %
Peak    horizontal track utilization = 54.55 %

[End of Global Routing] Elapsed real time: 0:00:00 
[End of Global Routing] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of Global Routing] Stage (MB): Used  105  Alloctr  105  Proc   80 
[End of Global Routing] Total (MB): Used  134  Alloctr  135  Proc 4724 
Writing out congestion map...
Updating congestion ...
Updating congestion ...
[End of dbOut] Elapsed real time: 0:00:00 
[End of dbOut] Elapsed cpu  time: sys=0:00:00 usr=0:00:00 total=0:00:00
[End of dbOut] Stage (MB): Used  -21  Alloctr  -21  Proc    0 
[End of dbOut] Total (MB): Used   36  Alloctr   37  Proc 4724 
Using per-layer congestion maps for congestion reduction.
Information: 7.69% of design has horizontal routing density above target_routing_density of 0.80.
Information: 0.00% of design has vertical routing density above target_routing_density of 0.80.
Completed transferring placement data.
Running placement using 1 thread(s)
Information: Enhanced Auto Density Control is used. (PLACE-098)
Information: Enhanced auto density configuration is 13179.
Information: Automatic density control has selected the following settings: max_density 0.70, congestion_driven_max_util 0.89. (PLACE-027)
Information: HFW control 'on' invoked.
coarse place 100% done.
Information: Reducing cell density for 0.0% of the movable cells to alleviate congestion. This changes the average cell density in non-congested areas from 0.843 to 0.843. (PLACE-030)
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
CGRW: permuting timing equivalent pins only
Corner Scaling is off, multiplier is 1.000000
Information: timingScenario func::nom timingCorner nom.  Using corner nom for worst leakage corner. (OPT-078)
Information: Using default layer M4 (OPT-079)
Information: Nominal = 0.0285335  Design MT = 0.500000  Target = 0.1133189  MaxRC = 0.078167 Fast Target = 0.036930 (OPT-081)
nplLib: default vr hor dist = 898
nplLib: default vr ver dist = 898
nplLib: default vr buf size = 6
nplLib: default vr buf size = 2
Placer using max_unbuffered_distance = 897.69

Placement Options:
Effort:                        medium_effort       
Timing Driven:                 true                
Buffering Aware Timing Driven: false               
Seed locs:                     true                
Incremental:                   false               
Congestion:                    true                
Congestion Effort:             medium              
Fix Macros:                    true                
Place Macros:                  false               
Channel Size Macros:           false               

Printing options for 'place.coarse.*' (non-default only)
place.coarse.continue_on_missing_scandef                :        true                
place.coarse.fix_cells_on_soft_blockages                :        true                

Information: Activity for scenario func::nom was cached, no propagation required. (POW-005)
****** eLpp estimated wire length 
9.57845% of the net wire length are clock nets
0% of the clock net wire length has no activity
Clock net wire length: 714497
Total net wire length: 7.45942e+06
****** eLpp weights (with caps) (no lengths)
Number of nets: 134, of which 133 non-clock nets
Number of nets with 0 toggle rate: 0 (0%)
Max toggle rate = 1, average toggle rate = 0.073579
Max non-clock toggle rate = 0.138306
eLpp weight range = (0.262937, 5.90941)
*** 2 nets are filtered out
Start transferring placement data.
****** Net weight manager: report ******
Weights included: eLpp  PostEffort  
Number of nets with non-default weights: 134
Amt power = 0.1
Non-default weight range: (0.926294, 5.49094)
                             Min         Max         Avg       Stdev        Skew
       Toggle Rates    0.0444946           1    0.073579   0.0847903     9.75993
      Power Weights     0.262937     5.90941    0.434809    0.501061     9.75993
      Final Weights     0.926294     5.49094    0.973332    0.392055     11.4168
Information: Automatic repeater spreading is enabled.
Information: Automatic timing control is enabled.
checking app option clockgate_objective_weight : none
Information: Clock gate latency aware placement is enabled. (PLACE-085)
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
DTDP placement: scenario=func::nom
Factor(1) = 1
Factor(BASE) = 1
Information: The net parasitics of block full_adder_8bit are cleared. (TIM-123)
Completed transferring placement data.
Running placement using 1 thread(s)
Information: Enhanced Auto Density Control is used. (PLACE-098)
Information: Enhanced auto density configuration is 13179.
Information: Automatic density control has selected the following settings: max_density 0.70, congestion_driven_max_util 0.89. (PLACE-027)
Information: HFW control 'on' invoked.
coarse place 50% done.
coarse place 75% done.
coarse place 100% done.
Information: Coarse placer wire length estimate = 775.789
Information: Coarse placer active wire length estimate = 119.071
Information: Coarse placer weighted wire length estimate = 1086.71
Information: Extraction observers are detached as design net change threshold is reached.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)
----------------------------------------------------------------
Fixing logic constant
Completed Timing-driven placement, Elapsed time =   0: 0: 0 
----------------------------------------------------------------
Running legalize_placement
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0088 seconds to build cellmap data
INFO: creating 3(r) x 3(c) GridCells YDim 8.36 XDim 8.36
INFO: number of GridCells (full_adder_8bit_v): 9
INFO: creating 3(r) x 3(c) GridCells YDim 8.36 XDim 8.36
INFO: number of GridCells (full_adder_8bit_v): 9
Total 0.0013 seconds to load 103 cell instances into cellmap, 103 cells are off site row
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 12 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 96 vias out of 360 total vias.

Legalizing Top Level Design full_adder_8bit ... 
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0086 seconds to build cellmap data
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
=====> Processed 15 ref cells (8 fillers) from library

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
     366.222          103        Yes DEFAULT_VA

Warning: max_legality_failures=5000 ignored.
        To use it, set limit_legality_checks to true.
Warning: max_legality_check_range=500 ignored.
        To use it, set limit_legality_checks to true.
Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                    103
number of references:                15
number of site rows:                 11
number of locations attempted:     1614
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:         103 (1215 total sites)
avg row height over cells:        1.672 um
rms cell displacement:            0.462 um ( 0.28 row height)
rms weighted cell displacement:   0.462 um ( 0.28 row height)
max cell displacement:            2.154 um ( 1.29 row height)
avg cell displacement:            0.354 um ( 0.21 row height)
avg weighted cell displacement:   0.354 um ( 0.21 row height)
number of cells moved:              103
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: U128 (NAND2X0_RVT)
  Input location: (19.3668,12.514)
  Legal location: (19.328,10.36)
  Displacement:   2.154 um ( 1.29 row height)
Cell: U159 (NAND2X0_RVT)
  Input location: (19.5488,6.0849)
  Legal location: (18.872,5.344)
  Displacement:   1.003 um ( 0.60 row height)
Cell: U156 (NAND2X0_RVT)
  Input location: (16.745,4.9276)
  Legal location: (15.832,5.344)
  Displacement:   1.003 um ( 0.60 row height)
Cell: U158 (NAND2X0_RVT)
  Input location: (17.2972,6.0345)
  Legal location: (16.744,5.344)
  Displacement:   0.885 um ( 0.53 row height)
Cell: SUM_reg[1] (DFFX1_RVT)
  Input location: (17.7773,11.2018)
  Legal location: (17.808,12.032)
  Displacement:   0.831 um ( 0.50 row height)
Cell: U104 (NAND2X0_RVT)
  Input location: (6.847,6.3523)
  Legal location: (7.32,7.016)
  Displacement:   0.815 um ( 0.49 row height)
Cell: regCin_reg (DFFSSRX1_RVT)
  Input location: (12.3188,5.6751)
  Legal location: (11.576,5.344)
  Displacement:   0.813 um ( 0.49 row height)
Cell: regA_reg[4] (DFFSSRX1_RVT)
  Input location: (2.238,11.2573)
  Legal location: (2.304,12.032)
  Displacement:   0.778 um ( 0.47 row height)
Cell: U105 (NAND2X0_RVT)
  Input location: (6.8419,7.6551)
  Legal location: (6.408,7.016)
  Displacement:   0.772 um ( 0.46 row height)
Cell: SUM_reg[2] (DFFX1_RVT)
  Input location: (17.7583,9.4495)
  Legal location: (17.808,8.688)
  Displacement:   0.763 um ( 0.46 row height)

Completed Legalization, Elapsed time =   0: 0: 0 
Moved 103 out of 103 cells, ratio = 1.000000
Total displacement = 42.043999(um)
Max displacement = 2.192800(um), U128 (19.366800, 12.514000, 0) => (19.327999, 10.360000, 0)
Displacement histogram:
  0 ~  10% cells displacement <=      0.05(um)
  0 ~  20% cells displacement <=      0.09(um)
  0 ~  30% cells displacement <=      0.14(um)
  0 ~  40% cells displacement <=      0.21(um)
  0 ~  50% cells displacement <=      0.32(um)
  0 ~  60% cells displacement <=      0.44(um)
  0 ~  70% cells displacement <=      0.55(um)
  0 ~  80% cells displacement <=      0.67(um)
  0 ~  90% cells displacement <=      0.78(um)
  0 ~ 100% cells displacement <=      2.19(um)
Legalization succeeded.
----------------------------------------------------------------
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069412 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.078122 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Information: Ending   place_opt / final_place / Timing and Congestion Driven Placement with Legalization (FLW-8001)
Information: Time: 2025-06-05 11:12:02 / Session:  00:07:13 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 1006 MB (FLW-8100)


Information: Ending   place_opt / final_place (FLW-8001)
Information: Time: 2025-06-05 11:12:02 / Session:  00:07:13 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 1006 MB (FLW-8100)

----------------------------------------------------------------------------------------------------------
Information: Starting place_opt / final_opto (FLW-8000)
Information: Time: 2025-06-05 11:12:02 / Session:  00:07:13 / Command:  00:00:06 / CPU:  00:00:06 / Memory: 1006 MB (FLW-8100)
----------------------------------------------------------------------------------------------------------

Place-opt optimization Phase 37 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Information: The net parasitics of block full_adder_8bit are cleared. (TIM-123)
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069412 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.078122 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (20000 20000) (219120 203920)
Number of VARs = 1
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 0
Blocked VAs: 
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)
Running final optimization step.

Information: Starting place_opt / final_opto / Optimization (1) (FLW-8000)
Information: Time: 2025-06-05 11:12:02 / Session:  00:07:13 / Command:  00:00:07 / CPU:  00:00:06 / Memory: 1006 MB (FLW-8100)

Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0083 seconds to build cellmap data
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
Total 0.0013 seconds to load 103 cell instances into cellmap
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells

Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0082 seconds to build cellmap data
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
Total 0.0013 seconds to load 103 cell instances into cellmap
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells
Place-opt optimization Phase 40 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Isolated 0 ports, skipped 0 ports
Already Isolated 0 ports, Deleted 0 existing Isolation cells 

Place-opt optimization Phase 41 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Corner Scaling is off, multiplier is 1.000000
Corner Scaling is off, multiplier is 1.000000
Information: Using default layer M4 (OPT-079)
bmap: stepx = stepy = 83600
creating bmap
DB units per micron : 10000
INFO: New Levelizer turned on
Place-opt optimization Phase 41 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 41 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Convert timing mode ...
Place-opt optimization Phase 42 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter  4         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Number of Site types in the design = 1
INFO: Skipping activation of hold scenarios prior to CUS.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Information: CTS will work on the following scenarios. (CTS-101)
Information: CTS will work on all clocks in active scenarios, including 1 master clocks and 0 generated clocks. (CTS-107)
Information: 'nom' is identified as primary corner for initial clock tree building. (CTS-103)
CCD app option: ccd.targeted_ccd_path_groups:  **clock_gating_default**
Target path group: scenario func::nom pathgroup **clock_gating_default**
Information: CCD will use corner nom for honoring max prepone/postpone limits
Uskew Characterizer: corner: nom, scalingFactor: 1.000
Information: 'nom' is identified as primary corner for initial clock tree building. (CTS-103)
@ CG solver holdWeight = 0.500000
@ CG solver setupWeight = 1.000000
@ CG solver delayCostWeight = 5.000000
@ CG solver zeroDirWeight = 5.000000
@ CG solver wnsWeight = 400.000000
CCD-Info: The design has concentrated toggle rate data.
CCD-Info: Estimated initial clock tree cost 0.00 estimated repeater count 0
CCD-Info: Estimated clock tree cost 0.00 estimated repeater count 0

Summary of messages during CTS:
===============================================================
  Tag   Count  Type           Description
---------------------------------------------------------------
CTS-038    1  Warning  No clock routing rule is specified.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)
INFO: Skipping deactivation of hold scenarios after CUS.
Number of Site types in the design = 1
Place-opt optimization Phase 42 Iter  5         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter  6         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter  7         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter  8         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Corner Scaling is off, multiplier is 1.000000
Information: Using default layer M4 (OPT-079)
bmap: stepx = stepy = 83600
creating bmap
DB units per micron : 10000
Place-opt optimization Phase 42 Iter  9         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 10         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Number of Site types in the design = 1
INFO: Skipping activation of hold scenarios prior to CUS.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Information: CTS will work on the following scenarios. (CTS-101)
Information: CTS will work on all clocks in active scenarios, including 1 master clocks and 0 generated clocks. (CTS-107)
Information: 'nom' is identified as primary corner for initial clock tree building. (CTS-103)
CCD app option: ccd.targeted_ccd_path_groups:  **clock_gating_default**
Target path group: scenario func::nom pathgroup **clock_gating_default**
Information: CCD will use corner nom for honoring max prepone/postpone limits
Uskew Characterizer: corner: nom, scalingFactor: 1.000
Information: 'nom' is identified as primary corner for initial clock tree building. (CTS-103)
@ CG solver holdWeight = 0.500000
@ CG solver setupWeight = 1.000000
@ CG solver delayCostWeight = 5.000000
@ CG solver zeroDirWeight = 5.000000
@ CG solver wnsWeight = 400.000000
CCD-Info: The design has concentrated toggle rate data.
CCD-Info: Estimated initial clock tree cost 0.00 estimated repeater count 0
CCD-Info: Estimated clock tree cost 0.00 estimated repeater count 0

Summary of messages during CTS:
===============================================================
  Tag   Count  Type           Description
---------------------------------------------------------------
CTS-038    1  Warning  No clock routing rule is specified.
Information: The value of option cts.compile.enable_cell_relocation has been overridden to "leaf_only" to support latency-driven placement. (CTS-973)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Warning: No clock routing rules were specified. Use set_clock_routing_rules to specify routing rules for accurate clock latency estimation. (OPT-902)
Information: Estimating clock gate latencies for scenario 'func::nom'. (OPT-909)
INFO: Skipping deactivation of hold scenarios after CUS.
Number of Site types in the design = 1
Place-opt optimization Phase 42 Iter 11         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 12         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 13         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 14         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 15         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 16         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 42 Iter 17         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Place-opt optimization summary            SETUP-COST    R2R-COST HOLD-COST LDRC-COST          AREA     LEAKAGE     INSTCNT            ELAPSE       MEM
Place-opt optimization Phase 43 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Convert timing mode ...
Place-opt optimization Phase 44 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Corner Scaling is off, multiplier is 1.000000
Information: Using default layer M4 (OPT-079)
bmap: stepx = stepy = 83600
creating bmap
DB units per micron : 10000
Place-opt optimization Phase 44 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 44 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 44 Iter  4         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Disable clock slack update for ideal clocks
Place-opt optimization Phase 45 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
INFO: cellmap features:  adv-rules=(N), pdc=(N), clock-rules=(Y)

Place-opt optimization Phase 46 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Convert timing mode ...
INFO: New Levelizer turned on

Place-opt optimization Phase 47 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Disable clock slack update for ideal clocks
Information: Activity for scenario func::nom was cached, no propagation required. (POW-005)
Place-opt optimization Phase 48 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
INFO: cellmap features:  adv-rules=(N), pdc=(N), clock-rules=(Y)

Place-opt optimization Phase 49 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
INFO: New Levelizer turned on
[ISR-TRACE] Pass 1    Filter stats     #static   #dynamic
[ISR-TRACE]          holdviol-filter       0 |      0 
[ISR-TRACE]         ok-driver-filter      49 |      0 


Place-opt optimization Phase 50 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Warning: No tie cell is available for constant fixing. (OPT-200)

Place-opt optimization Phase 51 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Place-opt optimization Phase 52 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Information: Ending   place_opt / final_opto / Optimization (1) (FLW-8001)
Information: Time: 2025-06-05 11:12:03 / Session:  00:07:14 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)

Information: Starting place_opt / final_opto / Legalization (1) (FLW-8000)
Information: Time: 2025-06-05 11:12:03 / Session:  00:07:14 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)

START_FUNC : legalize_placement_pre_run_core CPU :     35 s ( 0.01 hr) ELAPSE :    434 s ( 0.12 hr) MEM-PEAK :  1005 Mb
END_FUNC : legalize_placement_pre_run_core CPU :     35 s ( 0.01 hr) ELAPSE :    434 s ( 0.12 hr) MEM-PEAK :  1005 Mb
Place-opt optimization Phase 55 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 12 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 96 vias out of 360 total vias.

Legalizing Top Level Design full_adder_8bit ... 
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0083 seconds to build cellmap data
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
=====> Processed 15 ref cells (8 fillers) from library

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
     366.222          103        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                    103
number of references:                15
number of site rows:                 11
number of locations attempted:     1536
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:         103 (1215 total sites)
avg row height over cells:        1.672 um
rms cell displacement:            0.000 um ( 0.00 row height)
rms weighted cell displacement:   0.000 um ( 0.00 row height)
max cell displacement:            0.000 um ( 0.00 row height)
avg cell displacement:            0.000 um ( 0.00 row height)
avg weighted cell displacement:   0.000 um ( 0.00 row height)
number of cells moved:                0
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: U155 (AND2X1_RVT)
  Input location: (11.424,7.016)
  Legal location: (11.424,7.016)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U149 (AND2X1_RVT)
  Input location: (6.712,13.704)
  Legal location: (6.712,13.704)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U141 (AND2X1_RVT)
  Input location: (12.032,18.72)
  Legal location: (12.032,18.72)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U134 (AND2X1_RVT)
  Input location: (16.44,17.048)
  Legal location: (16.44,17.048)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U93 (AND2X1_RVT)
  Input location: (10.36,3.672)
  Legal location: (10.36,3.672)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U112 (AND2X1_RVT)
  Input location: (10.968,12.032)
  Legal location: (10.968,12.032)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U109 (AND2X1_RVT)
  Input location: (8.84,15.376)
  Legal location: (8.84,15.376)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U99 (AND2X1_RVT)
  Input location: (6.712,5.344)
  Legal location: (6.712,5.344)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U96 (AND2X1_RVT)
  Input location: (7.928,3.672)
  Legal location: (7.928,3.672)
  Displacement:   0.000 um ( 0.00 row height)
Cell: regCin_reg (DFFSSRX1_RVT)
  Input location: (11.576,5.344)
  Legal location: (11.576,5.344)
  Displacement:   0.000 um ( 0.00 row height)

Information: The net parasitics of block full_adder_8bit are cleared. (TIM-123)
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069412 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.078122 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

Information: Ending   place_opt / final_opto / Legalization (1) (FLW-8001)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)

Information: Starting place_opt / final_opto / Optimization (2) (FLW-8000)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)
INFO: Enabled CLO at stage after_LGL1.

INFO: place.legalize.enable_advanced_legalizer not set - need to revert CLO
INFO: First Place-opt did not mark run with CLO enabled/disabled property
INFO: Concurrent Legalization and Optimization (CLO) Reverted

Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0083 seconds to build cellmap data
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
Total 0.0013 seconds to load 103 cell instances into cellmap
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells
Place-opt optimization Phase 59 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Convert timing mode ...
INFO: New Levelizer turned on

Place-opt optimization Phase 60 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
INFO: New Levelizer turned on
Place-opt optimization Phase 60 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 60 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Convert timing mode ...
Place-opt optimization Phase 61 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 61 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 61 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 61 Iter  4         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 61 Iter  5         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 61 Iter  6         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Corner Scaling is off, multiplier is 1.000000
Information: Using default layer M4 (OPT-079)
bmap: stepx = stepy = 83600
creating bmap
DB units per micron : 10000
Place-opt optimization Phase 61 Iter  7         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization Phase 61 Iter  8         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Place-opt optimization Phase 62 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Place-opt optimization Phase 63 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Corner Scaling is off, multiplier is 1.000000
Corner Scaling is off, multiplier is 1.000000
Information: Using default layer M4 (OPT-079)
bmap: stepx = stepy = 83600
creating bmap
DB units per micron : 10000
INFO: New Levelizer turned on
Place-opt optimization Phase 63 Iter  2         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Place-opt optimization summary            SETUP-COST    R2R-COST HOLD-COST LDRC-COST          AREA     LEAKAGE     INSTCNT            ELAPSE       MEM
Place-opt optimization Phase 63 Iter  3         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Information: Ending   place_opt / final_opto / Optimization (2) (FLW-8001)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)

Information: Starting place_opt / final_opto / Legalization (2) (FLW-8000)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)

START_FUNC : legalize_placement_pre_run_core CPU :     35 s ( 0.01 hr) ELAPSE :    435 s ( 0.12 hr) MEM-PEAK :  1005 Mb
END_FUNC : legalize_placement_pre_run_core CPU :     35 s ( 0.01 hr) ELAPSE :    435 s ( 0.12 hr) MEM-PEAK :  1005 Mb
Place-opt optimization Phase 66 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 12 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 96 vias out of 360 total vias.

Legalizing Top Level Design full_adder_8bit ... 
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0084 seconds to build cellmap data
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
=====> Processed 15 ref cells (8 fillers) from library

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
     366.222          103        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                    103
number of references:                15
number of site rows:                 11
number of locations attempted:     1536
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:         103 (1215 total sites)
avg row height over cells:        1.672 um
rms cell displacement:            0.000 um ( 0.00 row height)
rms weighted cell displacement:   0.000 um ( 0.00 row height)
max cell displacement:            0.000 um ( 0.00 row height)
avg cell displacement:            0.000 um ( 0.00 row height)
avg weighted cell displacement:   0.000 um ( 0.00 row height)
number of cells moved:                0
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: U155 (AND2X1_RVT)
  Input location: (11.424,7.016)
  Legal location: (11.424,7.016)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U149 (AND2X1_RVT)
  Input location: (6.712,13.704)
  Legal location: (6.712,13.704)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U141 (AND2X1_RVT)
  Input location: (12.032,18.72)
  Legal location: (12.032,18.72)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U134 (AND2X1_RVT)
  Input location: (16.44,17.048)
  Legal location: (16.44,17.048)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U93 (AND2X1_RVT)
  Input location: (10.36,3.672)
  Legal location: (10.36,3.672)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U112 (AND2X1_RVT)
  Input location: (10.968,12.032)
  Legal location: (10.968,12.032)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U109 (AND2X1_RVT)
  Input location: (8.84,15.376)
  Legal location: (8.84,15.376)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U99 (AND2X1_RVT)
  Input location: (6.712,5.344)
  Legal location: (6.712,5.344)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U96 (AND2X1_RVT)
  Input location: (7.928,3.672)
  Legal location: (7.928,3.672)
  Displacement:   0.000 um ( 0.00 row height)
Cell: regCin_reg (DFFSSRX1_RVT)
  Input location: (11.576,5.344)
  Legal location: (11.576,5.344)
  Displacement:   0.000 um ( 0.00 row height)

Information: The net parasitics of block full_adder_8bit are cleared. (TIM-123)
Information: The stitching and editing of coupling caps is turned OFF for design 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'. (TIM-125)
Information: Design Average RC for design full_adder_8bit_v  (NEX-011)
Information: r = 1.787109 ohm/um, via_r = 0.460993 ohm/cut, c = 0.069412 ff/um, cc = 0.000000 ff/um (X dir) (NEX-017)
Information: r = 1.669142 ohm/um, via_r = 0.583365 ohm/cut, c = 0.078122 ff/um, cc = 0.000000 ff/um (Y dir) (NEX-017)
Information: The RC mode used is VR for design 'full_adder_8bit'. (NEX-022)
Information: Update timing completed net estimation for all the timing graph nets (TIM-111)
Information: Net estimation statistics: timing graph nets = 134, routed nets = 0, across physical hierarchy nets = 0, parasitics cached nets = 134, delay annotated nets = 0, parasitics annotated nets = 0, multi-voltage nets = 0. (TIM-112)

Information: Ending   place_opt / final_opto / Legalization (2) (FLW-8001)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)

Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0084 seconds to build cellmap data
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
INFO: creating 5(r) x 5(c) GridCells YDim 5.016 XDim 5.016
INFO: number of GridCells (full_adder_8bit_v): 25
Total 0.0013 seconds to load 103 cell instances into cellmap
Moveable cells: 103; Application fixed cells: 0; Macro cells: 0; User fixed cells: 0
Average cell width 1.7930, cell height 1.6720, cell area 2.9979 for total 103 placed and application fixed cells
Place-opt optimization Phase 68 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Place-opt optimization Phase 69 Iter  1         0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005

Information: Ending   place_opt / final_opto (FLW-8001)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)
Number of Site types in the design = 1
Setting up Chip Core
Chip Core shape: (20000 20000) (219120 203920)
Number of VARs = 1
Number of unique PDs = 1
Number of Power Domains = 1
Number of Voltage Areas = 1
Number of supply Nets = 2
Number of used supplies = 0
Blocked VAs: 
INFO: Running FTB cleanup in end of npo flow.
Enable dominated scenarios

Place-opt optimization complete                 0.00        0.00      0.00         0        308.78  629884736.00         103              0.12      1005
Co-efficient Ratio Summary:
4.193421605155  6.578038173730  2.479639287277  7.744187540401  0.485050000353  3.179565833784  5.567214754587  2.894454387461  6.565921217863  9.017937505874  93.924171609339  8.634325866903  0.781249940852  7.442083411238  3.181156049079
6.992250260832  4.646239500641  3.823702212269  3.871840296193  1.424294066690  9.687527899646  6.131807232944  1.465787932247  8.763589181122  1.911351036960  58.251887709427  0.014874156525  4.045016744037  5.020605316976  6.345884229962
1.220116795077  5.967847396778  6.224305671704  0.238797715000  3.284509589705  9.611151237147  0.128739689272  0.513551216982  7.835139826811  8.372519099733  96.314871844586  7.609761490104  3.894395664966  9.819999761759  1.487347087763
2.106393266767  9.078063326983  1.314288630187  8.805817928323  0.072343539122  6.270037326705  0.450494780240  3.928173631613  9.852544054410  0.210066110127  09.063269154570  7.466560403011  8.788098507826  8.572536784759  1.334182635409
0.279263772609  8.236528340626  1.425386746381  6.766529199187  4.740224950513  6.567966215027  5.706185626119  8.134461036181  4.723121071581  6.753657767486  66.060683395845  6.246905498804  2.738721239211  6.086733806504  8.868234594724
5.890240933684  8.439499448971  1.154902068601  4.924445220001  0.405169190953  4.590768921970  4.170951209159  0.006744354660  9.230842681426  9.005588346071  55.143697424446  3.794597128874  0.705461468271  6.012888717343  3.718510993956
2.708373361785  2.772683894677  2.637652116996  9.532707452994  6.656262309097  9.409795558072  6.136993113139  7.763510072170  9.625254751594  7.417690064932  84.971184617031  0.435165689906  6.662605126730  8.833424349383  2.924350216216
9.183179612142  4.225277311156  7.821040823519  1.416280356161  2.866938022019  5.692842603132  5.858445024802  5.513631359359  5.213535407563  4.512012804123  09.639285253000  5.220034945090  1.353328638724  6.508164485577  3.718848483731
1.254829368010  5.503386714941  2.422542123053  1.661090076272  7.011233081071  7.845256074711  0.998585147436  4.042327646769  7.943493242169  3.877015511999  41.875603650820  2.625005236990  0.179106442141  1.696278130334  1.418335537515
5.650943790989  3.602913670264  2.545902020920  8.464997847149  5.117746745773  4.047317127472  1.421981592074  0.044433141463  7.138041352498  4.361330991019  48.075825398206  1.031932695311  5.295633707259  5.477269363008  6.963367403103
7.847093641515  7.027411336156  4.766944246976  6.505239565921  0.874802189647  3.823894401463  8.324531610419  3.421605155657  8.038173730247  9.639287277774  03.753877610485  0.500033301566  5.658347145567  2.147545872894  4.543874616565
9.212178639017  9.375058743104  6.708009339863  4.395098516078  1.239640852744  2.083411238318  1.156049079699  2.250260832464  6.239500641382  3.702212269387  70.380334531424  2.940696777074  5.278906766131  8.072329441465  7.879322478763
5.891811221911  3.510369609637  3.414109427001  4.844388138404  5.006444037502  0.605316976634  5.884229962122  0.116795077596  7.847396778622  4.305671704023  49.855523603284  5.095827827008  1.512381770128  7.396892720513  5.512169827835
1.398268118372  5.190997333443  6.408244586760  9.731622717389  4.385364966981  9.999761759148  7.347087763210  6.393266767907  8.063326983131  4.288630187880  10.057656830072  3.435321094667  0.373277350450  4.947802403928  1.736316139852
5.440544100210  0.661101274718  5.896554570746  6.530635624878  8.088207826857  2.536784759133  4.182635409027  9.263772609823  6.528340626142  5.386746381676  27.179364474740  2.249535904954  9.662160575706  1.856261198134  4.610361814723
1.210715816753  6.577674860418  2.210795845624  6.975620417273  8.711939211608  6.733806504886  8.234594724589  0.240933684843  9.499448971115  4.902068601492  06.330673610405  1.691939302987  7.689229004170  9.512091590006  7.443546609230
8.426814269005  5.883460719326  5.224824446379  4.567350487070  5.451168271601  2.888717343371  8.510993956270  8.373361785277  2.683894677263  7.652116996953  89.952992546656  2.623020747896  7.955590026136  9.931131397763  5.100721709625
2.547515947417  6.900649322209  3.711017031043  5.135811519666  2.695826730883  3.424349383292  4.350216216918  3.179612142422  5.277311156782  1.040823519141  24.781934212866  9.380250963089  8.426041625858  4.450248025513  6.313593595213
5.354075634512  0.128041234775  1.812653000522  0.004177603135  3.318338724650  8.164485577371  8.848483731125  4.829368010550  3.386714941242  2.542123053166  72.888135327011  2.330840585232  2.560757410998  5.851474364042  3.276467697943
4.932421693877  0.155119998999  7.230050820262  5.075468503017  9.196142141169  6.278130334141  8.335537515565  0.943790989360  2.913670264254  5.902020920846  01.856844095117  7.467487502434  3.171284021421  9.815920740044  4.331414637138
0.413524984361  3.309910198619  7.452798206103  1.902827924529  5.623407259547  7.269363008696  3.367403103784  7.093641515702  7.411336156476  6.944246976650  14.273022810874  8.021826241210  8.944024938324  5.316104193421  6.051556578038
1.737302479639  2.872777744187  5.404010485050  0.003533179565  8.337845567214  7.545872894454  3.874616565921  2.178639017937  5.058743104670  8.009339863439  12.863533381239  6.408557210470  4.112393481156  0.490796992250  2.608324646239
5.006413823702  2.122693871840  2.961931424294  0.666909687527  8.996466131807  2.329441465787  9.322478763589  1.811221911351  0.369609637341  4.109427001484  05.769757645006  4.440305898092  3.169776645884  2.299621220116  7.950775967847
3.967786224305  6.717040238797  7.150003284509  5.897059611151  2.371470128739  6.892720513551  2.169827835139  8.268118372519  0.997333443640  8.244586760973  78.105546494385  3.649699687386  7.617501787347  0.877632106393  2.667679078063
3.269831314288  6.301878805817  9.283230072343  5.391226270037  3.267050450494  7.802403928173  6.316139852544  0.544100210066  1.101274718589  6.554570746653  68.234611388088  2.078298340923  7.847501634182  6.354090279263  7.726098236528
3.406261425386  7.463816766529  1.991874740224  9.505136567966  2.150275706185  6.261198134461  0.361814723121  0.715816753657  7.674860418221  0.795845624697  18.182545338711  9.392146854120  8.065058168234  5.947245890240  9.336848439499
4.489711154902  0.686014924445  2.200010405169  1.909534590768  9.219704170951  2.091590006744  3.546609230842  6.814269005588  3.460719326522  4.824446379456  35.482243305451  1.682746880275  7.173443018510  9.939562708373  3.617852772683
8.946772637652  1.169969532707  4.529946656262  3.090979409795  5.580726136993  1.131397763510  0.721709625254  7.515947417690  0.649322209371  1.017031043513  10.093569262695  8.267338601811  3.493842224350  2.162169183179  6.121424225277
3.111567821040  8.235191416280  3.561612866938  0.220195692842  6.031325858445  0.248025513631  3.593595213535  4.075634512012  8.041234775181  2.653000522000  03.654404953318  3.387276376551  4.855783018848  4.837311254829  3.680105503386
7.149412422542  1.230531661090  0.762727011233  0.810717845256  0.747110998585  1.474364042327  6.467697943493  2.421693877015  5.119998999723  0.050820262507  16.563403779196  1.421441464665  1.303351718335  5.375155650943  7.909893602913
6.702642545902  0.209208464997  8.471495117746  7.457734047317  1.274721421981  5.920740044433  1.414637138041  3.524984361330  9.910198619745  2.798206103190  80.157618895623  4.072525245656  3.630096263367  4.031037847093  6.415157027411
3.361564766944  2.469766505239  5.659210874802  1.896473823894  4.014638324531  6.104193421605  1.556578038173  7.302479639287  2.777744187540  4.010485050000  97.219168258337  8.455602915932  8.728954843874  6.165659212178  6.390179375058
7.431046708009  3.398634395098  5.160781239640  8.527442083411  2.383181156049  0.796992250260  8.324646239500  6.413823702212  2.693871840296  1.931424294066  21.974248878996  4.661348840716  4.414667179322  4.787635891811  2.219113510369
6.096373414109  4.270014844388  1.384045006444  0.375020605316  9.766345884229  9.621220116795  0.775967847396  7.786224305671  7.040238797715  0.003284509589  32.474584112371  4.701217164289  7.205145812169  8.278351398268  1.183725190997
3.334436408244  5.867609731622  7.173894385364  9.669819999761  7.591487347087  7.632106393266  7.679078063326  9.831314288630  1.878805817928  3.230072343539  74.140173973267  0.504534715299  4.039291036316  1.398525440544  1.002100661101
2.747185896554  5.707466530635  6.248788088207  8.268572536784  7.591334182635  4.090279263772  6.098236528340  6.261425386746  3.816766529199  1.874740224950  13.243042262150  2.757091624658  1.981354910361  8.147231210715  8.167536577674
8.604182210795  8.456246975620  4.172738711939  2.116086733806  5.048868234594  7.245890240933  6.848439499448  9.711154902068  6.014924445220  0.010405169190  57.223370289219  7.041739380488  5.900077743546  6.092308426814  2.690055883460
7.193265224824  4.463794567350  4.870705451168  2.716012888717  3.433718510993  9.562708373361  7.852772683894  6.772637652116  9.969532707452  9.946656262309  61.672460555580  7.261399709528  3.977645400721  7.096252547515  9.474176900649
3.222093711017  0.310435135811  5.196662695826  7.308833424349  3.832924350216  2.169183179612  1.424225277311  1.567821040823  5.191416280356  1.612866938022  63.834391026031  3.258514228635  0.255146613593  5.952135354075  6.345120128041
2.347751812653  0.005220004177  6.031353318338  7.246508164485  5.773718848483  7.311254829368  0.105503386714  9.412422542123  0.531661090076  2.727011233081  69.056825160747  1.109915629861  3.640433576467  6.979434932421  6.938770155119
9.989997230050  8.202625075468  5.030179196142  1.411696278130  3.341418335537  5.155650943790  9.893602913670  2.642545902020  9.208464997847  1.495117746745  39.228846771274  7.214249683317  7.400454631414  6.371380413524  9.843613309910
1.986197452798  2.061031902827  9.245295623407  2.595477269363  0.086963367403  1.037847093641  5.157027411336  1.564766944246  9.766505239565  9.210874802189  26.616601544014  6.383275184591  1.934226351556  5.780381737302  4.796392872777
7.441875404010  4.850500003533  1.795658337845  5.672147545872  8.944543874616  5.659212178639  0.179375058743  1.046708009339  8.634395098516  0.781239640852  36.308207712383  1.811590268183  9.922512908324  6.462395006413  8.237022122693
8.718402961931  4.242940666909  6.875278996466  1.318072329441  4.657879322478  7.635891811221  9.113510369609  6.373414109427  0.014844388138  4.045006444037  12.184426769766  3.458872067018  2.201177250775  9.678473967786  2.243056717040
2.387977150003  2.845095897059  6.111512371470  1.287396892720  5.135512169827  8.351398268118  3.725190997333  4.436408244586  7.609731622717  3.894385364966  50.077360217591  4.873400645029  1.063942967679  0.780633269831  3.142886301878
8.058179283230  0.723435391226  2.700373267050  4.504947802403  9.281736316139  8.525440544100  2.100661101274  7.185896554570  7.466530635624  8.788088207826  47.603730447591  3.341856122487  2.792647026098  2.365283406261  4.253867463816
7.665291991874  7.402249505136  5.679662150275  7.061856261198  1.344610361814  7.231210715816  7.536577674860  4.182210795845  6.246975620417  2.738711939211  22.745701665048  8.682375715632  8.902419636848  4.394994489711  1.549020686014
9.244452200010  4.051691909534  5.907689219704  1.709512091590  0.067443546609  2.308426814269  0.055883460719  3.265224824446  3.794567350487  0.705451168271  22.006250773433  7.185139707959  7.083743917852  7.726838946772  6.376521169969
5.327074529946  6.562623090979  4.097955580726  1.369931131397  7.635100721709  6.252547515947  4.176900649322  2.093711017031  0.435135811519  6.662695826730  40.212616093832  9.243532930556  1.831706421424  2.252773111567  8.210408235191
4.162803561612  8.669380220195  6.928426031325  8.584450248025  5.136313593595  2.135354075634  5.120128041234  7.751812653000  5.220004177603  1.353318338724  27.969017455773  7.188414605708  2.548203980105  5.033867149412  4.225421230531
6.610900762727  0.112330810717  8.452560747110  9.985851474364  0.423276467697  9.434932421693  8.770155119998  9.997230050820  2.625075468503  0.179196142141  78.840154903341  4.183385143542  6.509447209893  6.029136702642  5.459020209208

Place-opt final QoR
___________________
Scenario Mapping Table
1: func::nom

Pathgroup Mapping Table
1: **default**
2: **async_default**
3: **clock_gating_default**
4: **in2reg_default**
5: **reg2out_default**
6: **in2out_default**
7: Clock

-------------------------------------------------------------------------------------------------------------------------------------------------------------
PATHGROUP QOR 
-------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS    NSV      WHV        THV    NHV
    1   1   0.0000     0.0000      0   0.0000     0.0000      0
    1   2   0.0000     0.0000      0   0.0000     0.0000      0
    1   3   0.0000     0.0000      0   0.0000     0.0000      0
    1   4   0.0000     0.0000      0   0.0000     0.0000      0
    1   5   0.0000     0.0000      0   0.0000     0.0000      0
    1   6   0.0000     0.0000      0   0.0000     0.0000      0
    1   7   0.0000     0.0000      0   0.0027     0.0027      1
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
SCENARIO QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage
    1   *   0.0000     0.0000   0.0000      0   0.0027     0.0027      1        0     0.0000        0  629884736
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
DESIGN QOR 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------
Scene  PG      WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV   MaxTranC  MaxCapV    Leakage         Area    InstCnt     BufCnt     InvCnt
    *   *   0.0000     0.0000   0.0000      0   0.0027     0.0027      1        0     0.0000        0  629884736       308.78        103          0          0
----------------------------------------------------------------------------------------------------------------------------------------------------------------------

Place-opt final QoR Summary         WNS        TNS   R2RTNS    NSV      WHV        THV    NHV  MaxTrnV  MaxCapV    Leakage         Area    InstCnt
Place-opt final QoR Summary      0.0000     0.0000   0.0000      0   0.0027     0.0027      1        0        0  629884736       308.78        103

Place-opt command complete                CPU:    36 s (  0.01 hr )  ELAPSE:   435 s (  0.12 hr )  MEM-PEAK:  1005 MB
Place-opt command statistics  CPU=4 sec (0.00 hr) ELAPSED=4 sec (0.00 hr) MEM-PEAK=0.981 GB
Information: Running auto PG connection. (NDM-099)
Information: Ending   'place_opt' (FLW-8001)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:08 / CPU:  00:00:08 / Memory: 1006 MB (FLW-8100)
[icc2-lic Thu Jun  5 11:12:04 2025] Command 'legalize_placement' requires licenses
[icc2-lic Thu Jun  5 11:12:04 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:12:04 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:04 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:12:04 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:12:04 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:12:04 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:04 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:12:04 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:04 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:12:04 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:04 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:12:04 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:12:04 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:12:04 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:04 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:12:04 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:04 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:12:04 2025] Check-out of alternate set of keys directly with queueing was successful
Information: Starting 'legalize_placement' (FLW-8000)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 1006 MB (FLW-8100)
nplDplc2Placer::setParam(effort,1)
nplDplc2Placer::setParam(debug,0)
nplDplc2Placer::setParam(site_check,2)
nplDplc2Placer::setParam(app_firm_wgt,0)
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
PDC app_options settings =========
        place.legalize.enable_prerouted_net_check: 1
        place.legalize.num_tracks_for_access_check: 1
        place.legalize.use_eol_spacing_for_access_check: 0
        place.legalize.allow_touch_track_for_access_check: 1
        place.legalize.reduce_conservatism_in_eol_check: 0
        place.legalize.preroute_shape_merge_distance: 0.0
        place.legalize.enable_non_preferred_direction_span_check: 0

Layer M1: cached 0 shapes out of 12 total shapes.
Layer M2: cached 0 shapes out of 0 total shapes.
Cached 96 vias out of 360 total vias.

Legalizing Top Level Design full_adder_8bit ... 
Information: Initializing classic cellmap without advanced rules enabled and without PDC enabled
Information: The following app options are used in cellmap
        place.legalize.enable_color_aware_placement : false
        place.legalize.use_nll_query_cm : false
        place.legalize.enable_advanced_legalizer : false
        place.legalize.enable_prerouted_net_check : true
        place.legalize.enable_advanced_prerouted_net_check : false
        place.legalize.always_continue : true
        place.legalize.limit_legality_checks : false
        place.common.pnet_aware_density : 1.0000
        place.common.pnet_aware_min_width : 0.0000
        place.common.pnet_aware_layers : {}
        place.common.use_placement_model : false
        place.common.enable_advanced_placement_model : true
        cts.placement.cell_spacing_rule_style : maximum
Total 0.0085 seconds to build cellmap data
Information: Creating classic rule checker.
Warning: Routing direction of metal layer PO is neither "horizontal" nor "vertical".  PDC checks will not be performed on this layer. (PDC-003)
=====> Processed 15 ref cells (8 fillers) from library

Bounds/Regions In This Design:
        Area    Num Cells  Exclusive Name
 (square um)
     366.222          103        Yes DEFAULT_VA

Starting legalizer.
Warning: Exclusive bound 'DEFAULT' has no cells.
Optimizing Exclusive Bound 'DEFAULT_VA' (2/2)
    Done Exclusive Bound 'DEFAULT_VA' (2/2) (0 sec)
Legalization complete (0 total sec)

****************************************
  Report : Placement Attempts
  Site   : unit
****************************************

number of cells:                    103
number of references:                15
number of site rows:                 11
number of locations attempted:     1536
number of locations failed:           0  (0.0%)

Legality of references at locations:
0 references had failures.

Legality of references in rows:
0 references had row failures.

****************************************
  Report : Cell Displacements
****************************************

number of cells aggregated:         103 (1215 total sites)
avg row height over cells:        1.672 um
rms cell displacement:            0.000 um ( 0.00 row height)
rms weighted cell displacement:   0.000 um ( 0.00 row height)
max cell displacement:            0.000 um ( 0.00 row height)
avg cell displacement:            0.000 um ( 0.00 row height)
avg weighted cell displacement:   0.000 um ( 0.00 row height)
number of cells moved:                0
number of large displacements:        0
large displacement threshold:     3.000 row height

Displacements of worst 10 cells:
Cell: U155 (AND2X1_RVT)
  Input location: (11.424,7.016)
  Legal location: (11.424,7.016)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U149 (AND2X1_RVT)
  Input location: (6.712,13.704)
  Legal location: (6.712,13.704)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U141 (AND2X1_RVT)
  Input location: (12.032,18.72)
  Legal location: (12.032,18.72)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U134 (AND2X1_RVT)
  Input location: (16.44,17.048)
  Legal location: (16.44,17.048)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U93 (AND2X1_RVT)
  Input location: (10.36,3.672)
  Legal location: (10.36,3.672)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U112 (AND2X1_RVT)
  Input location: (10.968,12.032)
  Legal location: (10.968,12.032)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U109 (AND2X1_RVT)
  Input location: (8.84,15.376)
  Legal location: (8.84,15.376)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U99 (AND2X1_RVT)
  Input location: (6.712,5.344)
  Legal location: (6.712,5.344)
  Displacement:   0.000 um ( 0.00 row height)
Cell: U96 (AND2X1_RVT)
  Input location: (7.928,3.672)
  Legal location: (7.928,3.672)
  Displacement:   0.000 um ( 0.00 row height)
Cell: regCin_reg (DFFSSRX1_RVT)
  Input location: (11.576,5.344)
  Legal location: (11.576,5.344)
  Displacement:   0.000 um ( 0.00 row height)

Legalization succeeded.
Total Legalizer CPU: 0.043
Total Legalizer Wall Time: 0.043
----------------------------------------------------------------
Information: Ending   'legalize_placement' (FLW-8001)
Information: Time: 2025-06-05 11:12:04 / Session:  00:07:15 / Command:  00:00:00 / CPU:  00:00:00 / Memory: 1006 MB (FLW-8100)
Information: The command 'save_block' cleared the undo history. (UNDO-016)
Information: Saving block 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design'
Saving library 'FULL_ADDER_8BIT_LIB'
Information: Saving 'FULL_ADDER_8BIT_LIB:full_adder_8bit_v.design' to 'FULL_ADDER_8BIT_LIB:FULL_ADD_8BIT_Placement.design'. (DES-028)
Saving library 'FULL_ADDER_8BIT_LIB'
1
icc2_shell> report_qor
[icc2-lic Thu Jun  5 11:12:13 2025] Command 'report_qor' requires licenses
[icc2-lic Thu Jun  5 11:12:13 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:12:13 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:13 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:12:13 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:12:13 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:12:13 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:13 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:12:13 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:13 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:12:13 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:13 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:12:13 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:12:13 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:12:13 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:13 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:12:13 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:13 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:12:13 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : qor
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:12:13 2025
****************************************


Scenario           'func::nom'
Timing Path Group  '**in2reg_default**'
----------------------------------------
Levels of Logic:                      0
Critical Path Length:              0.50
Critical Path Slack:               1.03
Critical Path Clk Period:          2.00
Total Negative Slack:              0.00
No. of Violating Paths:               0
----------------------------------------

Scenario           'func::nom'
Timing Path Group  '**reg2out_default**'
----------------------------------------
Levels of Logic:                      0
Critical Path Length:              0.08
Critical Path Slack:               1.12
Critical Path Clk Period:          2.00
Total Negative Slack:              0.00
No. of Violating Paths:               0
----------------------------------------

Scenario           'func::nom'
Timing Path Group  'Clock'
----------------------------------------
Levels of Logic:                     16
Critical Path Length:              0.71
Critical Path Slack:               0.89
Critical Path Clk Period:          2.00
Total Negative Slack:              0.00
No. of Violating Paths:               0
Worst Hold Violation:             -0.00
Total Hold Violation:             -0.00
No. of Hold Violations:               1
----------------------------------------


Cell Count
----------------------------------------
Hierarchical Cell Count:              0
Hierarchical Port Count:              0
Leaf Cell Count:                    103
Buf/Inv Cell Count:                   0
Buf Cell Count:                       0
Inv Cell Count:                       0
Combinational Cell Count:            77
   Single-bit Isolation Cell Count:                        0
   Multi-bit Isolation Cell Count:                         0
   Isolation Cell Banking Ratio:                           0.00%
   Single-bit Level Shifter Cell Count:                    0
   Multi-bit Level Shifter Cell Count:                     0
   Level Shifter Cell Banking Ratio:                       0.00%
   Single-bit ELS Cell Count:                              0
   Multi-bit ELS Cell Count:                               0
   ELS Cell Banking Ratio:                                 0.00%
Sequential Cell Count:               26
   Integrated Clock-Gating Cell Count:                     0
   Sequential Macro Cell Count:                            0
   Single-bit Sequential Cell Count:                       26
   Multi-bit Sequential Cell Count:                        0
   Sequential Cell Banking Ratio:                          0.00%
   BitsPerflop:                                            1.00
Macro Count:                          0
----------------------------------------


Area
----------------------------------------
Combinational Area:              129.36
Noncombinational Area:           179.43
Buf/Inv Area:                      0.00
Total Buffer Area:                 0.00
Total Inverter Area:               0.00
Macro/Black Box Area:              0.00
Net Area:                             0
Net XLength:                     394.09
Net YLength:                     340.37
----------------------------------------
Cell Area (netlist):                            308.78
Cell Area (netlist and physical only):          308.79
Net Length:                      734.46


Design Rules
----------------------------------------
Total Number of Nets:               136
Nets with Violations:                 0
Max Trans Violations:                 0
Max Cap Violations:                   0
----------------------------------------

1
icc2_shell> report_timing
[icc2-lic Thu Jun  5 11:12:35 2025] Command 'report_timing' requires licenses
[icc2-lic Thu Jun  5 11:12:35 2025] Attempting to check-out alternate set of keys directly with queueing
[icc2-lic Thu Jun  5 11:12:35 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:35 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:12:35 2025] Sending check-out request for 'ICCompilerII-8' (1) with wait option
[icc2-lic Thu Jun  5 11:12:35 2025] Check-out request for 'ICCompilerII-8' with wait option succeeded
[icc2-lic Thu Jun  5 11:12:35 2025] Sending checkout check request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:35 2025] Checkout check request for 'ICCompilerII-8' returned 0 
[icc2-lic Thu Jun  5 11:12:35 2025] Sending count request for 'ICCompilerII-8' 
[icc2-lic Thu Jun  5 11:12:35 2025] Count request for 'ICCompilerII-8' returned 1 
[icc2-lic Thu Jun  5 11:12:35 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:35 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:12:35 2025] Sending check-out request for 'ICCompilerII-NX' (1) with wait option
[icc2-lic Thu Jun  5 11:12:35 2025] Check-out request for 'ICCompilerII-NX' with wait option succeeded
[icc2-lic Thu Jun  5 11:12:35 2025] Sending checkout check request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:35 2025] Checkout check request for 'ICCompilerII-NX' returned 0 
[icc2-lic Thu Jun  5 11:12:35 2025] Sending count request for 'ICCompilerII-NX' 
[icc2-lic Thu Jun  5 11:12:35 2025] Count request for 'ICCompilerII-NX' returned 1 
[icc2-lic Thu Jun  5 11:12:35 2025] Check-out of alternate set of keys directly with queueing was successful
****************************************
Report : timing
        -path_type full
        -delay_type max
        -max_paths 1
        -report_by design
Design : full_adder_8bit
Version: W-2024.09
Date   : Thu Jun  5 11:12:35 2025
****************************************

  Startpoint: regB_reg[0] (rising edge-triggered flip-flop clocked by Clock)
  Endpoint: SUM_reg[7] (rising edge-triggered flip-flop clocked by Clock)
  Mode: func
  Corner: nom
  Scenario: func::nom
  Path Group: Clock
  Path Type: max

  Point                                            Incr      Path  
  ------------------------------------------------------------------------
  clock Clock (rise edge)                          0.00      0.00
  clock network delay (ideal)                      0.00      0.00

  regB_reg[0]/CLK (DFFSSRX1_RVT)                   0.00      0.00 r
  regB_reg[0]/Q (DFFSSRX1_RVT)                     0.09      0.09 f
  U85/Y (NAND2X0_RVT)                              0.03      0.13 r
  U90/Y (NAND4X0_RVT)                              0.04      0.17 f
  U91/Y (NAND2X0_RVT)                              0.05      0.22 r
  U93/Y (AND2X1_RVT)                               0.03      0.24 r
  U94/Y (NAND2X0_RVT)                              0.02      0.26 f
  U96/Y (AND2X1_RVT)                               0.04      0.30 f
  U97/Y (NAND2X0_RVT)                              0.04      0.34 r
  U106/Y (NAND4X0_RVT)                             0.05      0.39 f
  U107/Y (NAND2X0_RVT)                             0.05      0.44 r
  U109/Y (AND2X1_RVT)                              0.03      0.47 r
  U110/Y (NAND2X0_RVT)                             0.02      0.48 f
  U112/Y (AND2X1_RVT)                              0.05      0.53 f
  U113/Y (NAND2X0_RVT)                             0.04      0.57 r
  U116/Y (NAND4X0_RVT)                             0.04      0.62 f
  U120/Y (NAND2X0_RVT)                             0.05      0.67 r
  U67/Y (OR2X1_RVT)                                0.04      0.71 r
  SUM_reg[7]/D (DFFSSRX1_RVT)                      0.00      0.71 r
  data arrival time                                          0.71

  clock Clock (rise edge)                          2.00      2.00
  clock network delay (ideal)                      0.00      2.00
  SUM_reg[7]/CLK (DFFSSRX1_RVT)                    0.00      2.00 r
  clock uncertainty                               -0.30      1.70
  library setup time                              -0.10      1.60
  data required time                                         1.60
  ------------------------------------------------------------------------
  data required time                                         1.60
  data arrival time                                         -0.71
  ------------------------------------------------------------------------
  slack (MET)                                                0.89


1
icc2_shell> 